[
    {
        "name": "Абап",
        "forms": "(«ABAP», «Advanced Business Application Programming»)",
        "description": " — проприетарный внутренний язык программирования высокого уровня с синтаксисом, используемым в приложениях корпорации SAP"
    },
    {
        "name": "ASP",
        "forms": "(от англ. «Application Service Provider»)",
        "description": " — организация - провайдер, предоставляющая услуги по аренде программных продуктов и инфраструктуры на базе периодических платежей с доступом к приложениям через Интернет или виртуальную частную сеть"
    },
    {
        "name": "Абстрактная функция",
        "forms": "(или «чистая виртуальная функция», от англ. «abstract function»)",
        "description": " — это функция без определения, которую переопределяют дочерние классы"
    },
    {
        "name": "Ава ",
        "forms": "(или «аватарка», от англ. «avatar»)",
        "description": " — графическое обозначение пользователя в Интернете (картинка/фото/изображение)"
    },
    {
        "name": "Авечка",
        "forms": "",
        "description": "звуковая карта Sound Blaster AWE32 на шине ISA, представленная Creative Technology в марте 1994 года"
    },
    {
        "name": "Автогад",
        "forms": "",
        "description": "система автоматизированного проектирования и черчения AutoCAD"
    },
    {
        "name": "Авторизация",
        "forms": "(от англ. «authorization»)",
        "description": " — процесс проверки (подтверждения) прав при попытке выполнения неких действий"
    },
    {
        "name": "Адаптив",
        "forms": "(или «адаптивный дизайн», от англ. «adaptation»)",
        "description": "процесс адаптации веб-страниц или веб-интерфейса к использованию на экранах различных устройств"
    },
    {
        "name": "Аджайл",
        "forms": "(от англ. «Agile»)",
        "description": "гибкая методология разработки, объединяющая в себе целый ряд подходов и практик, основанных на 12 принципах Манифеста гибкой разработки программного обеспечения, а также практические подходы к разработке"
    },
    {
        "name": "Админ",
        "forms": "(или «администратор», от англ. «admin»)",
        "description": " специалист, занимающийся настройкой, совершенствованием и поддержкой IT-инфраструктуры, включая периферию, оборудование, программное обеспечение и сетевые подключения"
    },
    {
        "name": "АДСЛ",
        "forms": "(от англ. «ADSL», «Asymmetric Digital Subscriber Line»)",
        "description": "технология, которая позволяет подключаться к интернету и обеспечивать высокоскоростную передачу данных через существующие телефонные линии"
    },
    {
        "name": "Айди",
        "forms": "(или «айдишник», от англ. «id», «identificator»)",
        "description": "уникальный признак объекта, который позволяет отличить его от других объектов, то есть идентифицировать"
    },
    {
        "name": "Айпи",
        "forms": "(или «айпишник», «айпи-адрес», от англ. «IP», «Internet Protocol Address»)",
        "description": "уникальный адрес компьютера в Сети, который присваивается провайдером индивидуально каждому устройству и даёт возможность выхода в Интернет"
    },
    {
        "name": "Айти",
        "forms": "(или «ИТ», «информационные технологии», от англ. «IT», «Information Technologies»)",
        "description": "довольно обширный класс дисциплин и областей деятельности, которые относятся к современным технологиям. Другими словами, это отрасль, отвечающая за обработку, сбор, хранение и передачу информации с помощью технических устройств и вычислительной техники"
    },
    {
        "name": "Айти-евангелист",
        "forms": "(или «IT-проповедник», «it-пропагандист», от англ. «Technology evangelist»)",
        "description": "человек, который профессионально занимается пропагандой в сфере IT. Как правило, такой человек собирает вокруг себя определенную группу людей для создания целевой аудитории для дальнейшего продвижения товара/услуги на рынке. Целью его деятельности является утверждение продукта как технологического стандарта на рынке"
    },
    {
        "name": "Айтишник",
        "forms": "(или «айтишнег», «ойтишнег», «ойтишник», от англ. «Information Technologies»)",
        "description": "специалист в сфере информационных технологий. Чаще всего айтишниками сейчас называют всех программистов и людей, так или иначе связанных с компьютерами"
    },
    {
        "name": "Ака",
        "forms": "(от англ. «a.k.a», «also known as»)",
        "description": "если дословно переводить, звучит как «еще известен как», «другими словами»"
    },
    {
        "name": "Аккаунт",
        "forms": "(или «акаунт», «ак», от англ. «account»)",
        "description": "учетная запись, совокупность данных пользователя, необходимых для его аутентификации. Обычно создается после регистрации на каком-либо ресурсе (на сайте / в приложении/ в программе)"
    },
    {
        "name": "Акцесс",
        "forms": "(от англ. «access»)",
        "description": "1) уровень доступа пользователя; 2) реляционная система управления базами данных (СУБД) корпорации Microsoft, входящая в состав пакета Microsoft Office (широкий круг функций, в т.ч. связанные запросы, связь с внешними таблицами и базами данных)"
    },
    {
        "name": "Алгоритм",
        "forms": "",
        "description": "строго определенный порядок действий /система правил/ набор инструкций, предназначенных для решения определенной задачи"
    },
    {
        "name": "Альфа",
        "forms": "",
        "description": "Это внутренний/непубличный этап разработки ПО, во время которого разработчики дополняют программу новыми функциями, после чего тестировщики проверяют/испытывают измененную программу"
    },
    {
        "name": "Альяс",
        "forms": "(или «алиас»)",
        "description": "псевдоним, короткое и легко запоминающееся имя, которое используют вместо длинного и сложного"
    },
    {
        "name": "Анлим",
        "forms": "(или «безлимит», от англ. «unlimited»)",
        "description": "в широком смысле - неограниченный доступ к чему-либо"
    },
    {
        "name": "Аноним",
        "forms": "(или «анонимус», «анон», от англ. «anonym», «anonymous»)",
        "description": "человек, по тем или иным причинам, скрывающий свою личность"
    },
    {
        "name": "Анпаблишед",
        "forms": "(или «унпаблишед», от англ. «unpublished»)",
        "description": "неопубликованный или неизданный"
    },
    {
        "name": "Анрег",
        "forms": "",
        "description": "незарегистрированный пользователь, ранее не проходивший аутентификацию на ресурсе/программе"
    },
    {
        "name": "Апгрейд",
        "forms": "(от англ. «upgrade»)",
        "description": "усовершенствование / обновление и модернизация компьютерной техники (железа), программного обеспечения, аппаратуры и т.д."
    },
    {
        "name": "Апдейт",
        "forms": "(от англ. «update»)",
        "description": "обновление/модернизация программного обеспечения (софта)"
    },
    {
        "name": "Апликуха ",
        "forms": "(от англ. «application»)",
        "description": "прикладное программное обеспечение (компьютерная программа / мобильное приложение), предназначенное для выполнения определённых задач"
    },
    {
        "name": "Аплинк",
        "forms": "(от англ. «uplink»)",
        "description": "1) вышестоящий линк, с которого узел забирает почту; 2) UpLink-порт - порт для каскадного соединения свитчей или хабов, у которых нет автоопределения обжима кабеля"
    },
    {
        "name": "Апрув",
        "forms": "(или «аппрув», «заапрувить», от англ. «approve»)",
        "description": "подтверждение, согласие, одобрение чего-либо после проведения предварительной проверки/модерации"
    },
    {
        "name": "Аркмейл",
        "forms": "(от англ. «ArcMail»)",
        "description": "архивированная почта, т.е. сжатая архиватором"
    },
    {
        "name": "Архиватор",
        "forms": "",
        "description": "программа, которая предназначена для сжатия файлов без потери качества в единый архив (например, 7-Zip, WinRAR и др.)"
    },
    {
        "name": "Асл",
        "forms": "(от англ. «age/sex/location»)",
        "description": "категории для заполнения: возраст/пол/место жительства"
    },
    {
        "name": "Ассемблер",
        "forms": "(или «Асм», от англ. «Assembler»)",
        "description": "это транслятор (переводчик), который преобразует программный код, написанный на языке Ассемблера, в машинный язык"
    },
    {
        "name": "Аттач",
        "forms": "(от англ. «attach»)",
        "description": "файл, который прикреплён к электронному письму или XML"
    },
    {
        "name": "Аутбаунд",
        "forms": "(от англ. «outbound»)",
        "description": "каталог с исходящей почтой"
    },
    {
        "name": "Аутсорс",
        "forms": "(или «аутсорсинг», от англ. «outsource»)",
        "description": "распространенная практика, когда компания передает часть рабочих задач специалистам вне своего штата (фрилансерам / работникам других компаний)"
    },
    {
        "name": "API",
        "forms": "(или «Апишка», от англ. «API», «Application Programming Interface»)",
        "description": "программный интерфейс приложения или интерфейс прикладного программирования. Простыми словами, это описание вариантов взаимодействия компьютерных программ между собой"
    },
    {
        "name": "BCP",
        "forms": "(от англ. «Business Continuity Planning»)",
        "description": "деятельность, направленная на снижение рисков прерывания бизнеса. Затрагивает предупреждение негативных последствий подобных сбоев, а также последующее восстановление бизнеса до приемлемого уровня"
    },
    {
        "name": "Баг",
        "forms": " (или «программная ошибка», от англ. «bug»)",
        "description": "некая ошибка/дефект в написанном коде/программе, из-за которой программа ведет себя неожиданно, и, как следствие, выдает неправильные результаты"
    },
    {
        "name": "Багоюзер",
        "forms": "(или «баггер»)",
        "description": "пользователь, который в своих интересах использует баги программ (для получения выгоды, денег, продвижения и т. д.)"
    },
    {
        "name": "Баг репорт",
        "forms": "(от англ. «bug report»)",
        "description": " уведомление или отчёт об ошибке, где содержится описание, причина её появления, приоритетом и прочими свойствами"
    },
    {
        "name": "База Данных",
        "forms": "(или «БД»)",
        "description": "1) программный или программно-аппаратный комплекс, разработанный для хранения большого объема различной информации; 2) совокупность данных, хранимых в соответствии со схемой данных, операции с которыми выполняют в соответствии с правилами средств моделирования данных"
    },
    {
        "name": "Байт",
        "forms": "(от англ. «byte»)",
        "description": " базовая единица хранения и обработки информации, которая состоит из 8 битов"
    },
    {
        "name": "Бан",
        "forms": "(от англ. «ban»)",
        "description": "способ контроля за его действиями пользователей за счет ограничения или полного лишения их определенных прав (например: оставлять комментарии, просматривать определённые страницы и т.д.)"
    },
    {
        "name": "Бандл",
        "forms": "(от англ. «bundle»)",
        "description": "эффективный маркетинговый прием, направленный на продвижение как самого продукта, так и сопутствующих товаров"
    },
    {
        "name": "Баннер",
        "forms": "(от англ. «banner»)",
        "description": "графическое или анимированное изображение, как правило, рекламного характера, размещаемое на интернет-площадках. Используется для привлечения внимания потенциальных клиентов"
    },
    {
        "name": "Банщик",
        "forms": "",
        "description": "дизайнер, который, с помощью графических редакторов, занимается версткой и созданием рекламных баннеров"
    },
    {
        "name": "Батник",
        "forms": "(или «бат», «бач», «бачфайл», от англ. «batch file»)",
        "description": " пакетный файл, т.е. текстовый файл (MS-DOS, OS/2 или Windows), который содержит последовательность команд, служащих для исполнения командным"
    },
    {
        "name": "Батон",
        "forms": "(или «батончик», «бАттон», от англ. «button»)",
        "description": "элемент интерфейса приложения/компьютерной программы, простыми словами \"кнопка\" (радиобатоны и пуш‑батоны)"
    },
    {
        "name": "Бахнуть",
        "forms": "",
        "description": "сделать что-то быстро, на скорую руку, например, скорректировать или расширить функционал приложения"
    },
    {
        "name": "ББС",
        "forms": "(или «БиБиэС», «бибиэска», «доска», «борда», от англ. «bulletin board system»)",
        "description": "доска объявлений в электронном формате — широко применяемый в эпоху веб 1.0 способ взаимодействия пользователей компьютеров через коммутируемые телефонные сети"
    },
    {
        "name": "Безголовый",
        "forms": "(от англ. «headless»)",
        "description": "имеется ввиду компьютер, который работает без устройства для вывода визуала, т.е. дисплея/монитора. Это может быть, к примеру, сервер. Безголовая система обычно управляется через сетевое соединение"
    },
    {
        "name": "Бенефит",
        "forms": "(от англ. «benefit»)",
        "description": "некий бонус, использующийся для мотивации сотрудников. Обычно это непрямое денежное или иное нематериальное вознаграждение"
    },
    {
        "name": "Бенч",
        "forms": "(от англ. «bench»)",
        "description": "обычно, имеется ввиду режим ожидания, простой специалиста в связи с отсутствием новых задач/проектов (при этом он получает зарплату)"
    },
    {
        "name": "Бенчмарк",
        "forms": "(от англ. «Benchmark»)",
        "description": "задача, которая является эталонным тестом производительности компьютерной системы. Обычно бенчмарки меряют в попугаях"
    },
    {
        "name": "Бета",
        "forms": "(от англ. «beta»)",
        "description": "бета-версия - рабочая версия ПО/сайта/приложения, которая находится на стадии публичного тестирования и доработки"
    },
    {
        "name": "Бета-тест",
        "forms": "(от англ. «beta-test»)",
        "description": "последнее испытание разрабатываемого продукта (ПО/приложения/сайта) перед его официальным выпуском"
    },
    {
        "name": "Бета-тестер",
        "forms": "(от англ. «beta-tester»)",
        "description": "человек, добровольно принимающий участие в бета-тестировании разрабатываемого продукта (сайта/ПО/приложения)"
    },
    {
        "name": "Библиотека",
        "forms": "",
        "description": "набор скомпилированного кода (например, функций), который «упакован» для вторичного использования в других программах. Библиотеки необходимы, для расширения возможностей программ"
    },
    {
        "name": "Бигдата",
        "forms": "(от англ. «big data»)",
        "description": "набор специализированных методов и инструментов, использующихся для хранения и обработки огромных объемов данных, т.е. таких, которые характеризуются «тремя V»: volume (объём), velocity (скорость прироста и обработки), variety (многообразие)"
    },
    {
        "name": "Бинк",
        "forms": "(от англ. «Bink»)",
        "description": "сокращённое название мейлеров типа BinkleyTerm. Бинком сейчас, чаще всего, называют популярный IP-мейлер binkd"
    },
    {
        "name": "Бипер",
        "forms": "(от англ. «beep»)",
        "description": "1) встроенный динамик ПК; 2) устройство, которое служит для генерации тонов DTMF, используется совместно с телефонами, не поддерживающими тоновый набор; 3) цифровой пейджер"
    },
    {
        "name": "Бит",
        "forms": "(от англ. «bit»",
        "description": "минимальная неделимая единица измерения количества информации. Принимает два значения: вкл/выкл, да/нет, высокий/низкий и т.д. В двоичной системе исчисления это либо 0, либо 1"
    },
    {
        "name": "Биткоин",
        "forms": "(или «BTC», от англ. «bitcoin»)",
        "description": "пиринговая платёжная система, появившаяся в 2009 году. В обороте - одноимённая единица для учёта операций (bitcoin): популярная электронная криптовалюта"
    },
    {
        "name": "Битый",
        "forms": "",
        "description": "некорректный / нерабочий / содержащий ошибку. Так, «битая ссылка» ведет на несуществующую страницу с ошибкой 404 (Error 404), «битые пиксели» - неправильно отображают цвета на мониторе"
    },
    {
        "name": "Блин",
        "forms": "",
        "description": "в компьютерной сфере так называют компакт-диск, CD, DVD, либо один из дисков в харде (жесткий диск)"
    },
    {
        "name": "Блинница",
        "forms": "(или «CD-привод»)",
        "description": "привод компакт-дисков, устройство для записи и считывания информации с оптических дисков с помощью лазера"
    },
    {
        "name": "Блог",
        "forms": "(или «канал», от англ. «weblog»)",
        "description": "дневник или журнал пользователя в Сети, в котором юзер ведет личные записи (в текстовом формате, фото или видео). Обычно, блог находится в открытом доступе и другие интернет-пользователи могу просматривать содержащиеся в нем записи. Следует отличать блог от гостевых книг, форумов и чатов"
    },
    {
        "name": "Блок-схема",
        "forms": "",
        "description": "графическая схема/модель, предназначенная для описания алгоритмов или процессов, где шаги изображаются в виде блоков различной формы, соединённых между собой линиями, указывающими направление последовательности. Используется программистами в процессе разработки и анализа логики работы программных компонентов"
    },
    {
        "name": "Блокчейн",
        "forms": "(от англ. «blockchain»)",
        "description": "методика построения непрерывной последовательной цепочки блоков (связного списка), которые содержат определенную информацию. Внесение изменений в информацию существующих блоков очень проблематично, т.к., чаще всего, копии цепочек блоков хранятся на множестве разных компьютеров независимо друг от друга. Кроме того, если необходимо внести какие-либо изменения в информацию одного из блоков, придётся редактировать и все последующие блоки"
    },
    {
        "name": "Блохи",
        "forms": "",
        "description": "шуточное название, обозначающее небольшие баги, т.е. незначительные проблемы в разработанном ПО, приложении, сайте"
    },
    {
        "name": "Блютус",
        "forms": "(или «блютуз», «блюпуп», «блютуф», «синий зуб», от англ. «Bluetooth»)",
        "description": "технология беспроводной связи, которая обеспечивает обмен информацией между устройствами (ПК, ноутбуки, мобильные телефоны, принтеры, мыши, клавиатуры, джойстики, наушники и т.д.) на бесплатной и повсеместно доступной радиочастоте для ближней связи"
    },
    {
        "name": "Блястер",
        "forms": "",
        "description": " звуковая плата SoundBlaster, выпускаемая фирмой Creative Technology, для IBM PC-совместимых ПК"
    },
    {
        "name": "Бог",
        "forms": "",
        "description": "1) главный администратор сайта/сети/сервера, у которого имеется максимальный уровень прав; 2) наивысший уровень в игре, при котором доступны все возможности (GodMode - режим бога)"
    },
    {
        "name": "Болванка",
        "forms": "",
        "description": "чистый компакт-диск, который не содержит на себе информацию"
    },
    {
        "name": "Борланд",
        "forms": "(или «Багланд», от англ. «Borland»)",
        "description": "компания Borland International, которая занимается производством ПО, более знаменита как создатель популярных инструментов для разработчиков Turbo Pascal, Delphi, компилятора Borland С++"
    },
    {
        "name": "Бот",
        "forms": "(от англ. «robot»)",
        "description": "ПО, предназначенное для автоматизации рутинных задач человека, иногда с зачатками искусственного интеллекта (к примеру, чат- бот на сайтах, который отвечает на заранее запрограммированные несложные вопросы)"
    },
    {
        "name": "Ботнет",
        "forms": "",
        "description": "компьютерная сеть, которая состоит из определенного количества хостов с действующими ботами — автономным ПО. Чаще всего, бот в составе ботнета - программа для скрытой установки на устройство жертвы, которая позволяет злоумышленнику выполнять некие действия с использованием ресурсов заражённого компьютера"
    },
    {
        "name": "Браузер",
        "forms": "(или «броузер», «бровсер», «бродилка», от англ. «browser»)",
        "description": "программное обеспечение, которое устанавливается на компьютер или телефон, позволяя выходить в Интернет и просматривать веб-странички (Internet Explorer, Chrome, Opera и пр.)"
    },
    {
        "name": "Брейншторм",
        "forms": "(от англ. «brainstorm»)",
        "description": "мозговой штурм, используется компаниями для генерации интересных идей и вариантов, а так же для поиска решений существующих проблем"
    },
    {
        "name": "БСОД",
        "forms": "(от англ. «BSoD: blue screen of death»)",
        "description": "«синий экран смерти», уведомление о крупной ошибке системы в некоторых версиях OS Windows. Обычно требует перезагрузки системы"
    },
    {
        "name": "Буржунет",
        "forms": "",
        "description": "зарубежная часть интернета, которая находится за пределами русскоязычного сегмента. Часто под \"буржунетом\" подразумевают англоязычные сайты из Европы и США"
    },
    {
        "name": "Бутик",
        "forms": "",
        "description": "внутренний загрузочный файл компьютера (boot.ini) с параметрами запуска, использующийся загрузчиком NTLDR при запуске Windows NT"
    },
    {
        "name": "Бутить",
        "forms": "(или «ребутить»)",
        "description": "перезагружать компьютер или ноутбук с помощью мыши или клавиатуры"
    },
    {
        "name": "Бутявка",
        "forms": "",
        "description": "загрузочная флэшка (дискета), на которой находится записанный образ установочного диска и сам загрузчик"
    },
    {
        "name": "Буфер данных",
        "forms": "",
        "description": "это определённая часть памяти на устройстве, которая резервируется под временное хранение данных, в то время как они перемещаются из одного места в другое"
    },
    {
        "name": "Бэд",
        "forms": "(или «бады», «бэдмейл», от англ. «bad»)",
        "description": "почта, которая дошла получателю с ошибками, либо же неформальное название области, куда эта почта попадает (Badmail)"
    },
    {
        "name": "Бэды ",
        "forms": "(или «бэдблоки», «бэдсекторы», от англ. «badsector», «badblock»)",
        "description": "не читающийся/ненадежный кластер диска, который содержит в себе сбойные сектора, или помечен как таковой в структурах файловой системы"
    },
    {
        "name": "Бэкап",
        "forms": "(от англ. «backup»)",
        "description": "резервное копирование, т.е. создание резервной копии информации/проекта/сайта, для того, чтобы при каких-либо ошибках и сбоях иметь возможность восстановить данные. Безопасным считается регулярное обновление бэкапов и хранение их на различных устройствах"
    },
    {
        "name": "Бэкенд",
        "forms": "(от англ. «back-end»)",
        "description": "непосредственно сама программно-аппаратная или серверная часть приложения, а также разработка этой «внутренней части» сайтов/ПО/приложений"
    },
    {
        "name": "Бэклог",
        "forms": "(от англ. «backlog»)",
        "description": "перечень задач по функционалу в порядке приоритета для реализации в следующих версиях продукта"
    },
    {
        "name": "Вай-Фай",
        "forms": "(или «ви-фи», «вафля», от англ. «Wi-Fi»)",
        "description": "технология беспроводных локальных сетей с устройствами на основе стандартов IEEE 802.11"
    },
    {
        "name": "Валидатор",
        "forms": "",
        "description": "программное обеспечение или ресурс, проверяющие на правильность написанные код или форму"
    },
    {
        "name": "Валидация",
        "forms": "(от англ. «validation»)",
        "description": "это проверка систем, процессов, пользователей насколько они соответствует определенным заданным условиям"
    },
    {
        "name": "Валидный",
        "forms": "(от англ. «valid»)",
        "description": " допустимый, корректный, приемлемый. Тот, который соответствует установленным правилам и условиям"
    },
    {
        "name": "Варез",
        "forms": "(от англ. «warez»)",
        "description": "интеллектуальная собственность или ПО, свободно распространяемое в Интернете, незаконным путем с нарушением прав правообладателя"
    },
    {
        "name": "Варезник",
        "forms": "",
        "description": "сайт (обычно, файлообменник), на котором в открытом доступе присутствует \"варез\" (пиратское ПО, кинофильмы/музыка, книги и т.д.)"
    },
    {
        "name": "Варнинг",
        "forms": "(или «ворнинг», от англ. «warning»)",
        "description": "предупреждающее сообщение в интерфейсе. Не является ошибкой, но может иметь негативные последствия для написанного кода"
    },
    {
        "name": "Вебинар",
        "forms": "(от англ. «web based seminar»)",
        "description": "это выступление, лекция или презентация на выбранную тему, проходящая в сети Интернет в онлайн режиме. Также, вебинаром называют и запись проведенного ранее онлайн вебинара"
    },
    {
        "name": "Видюха",
        "forms": "(или «видяха», «видимо-карта»)",
        "description": "видеокарта, т.е. устройство, которое обрабатывает информацию и преобразует графический образ в форму, пригодную для дальнейшего вывода на экран монитора. Простыми словами, это та деталь, с помощью которого изображение выводится на монитор"
    },
    {
        "name": "Визит",
        "forms": "",
        "description": "каждое посещение/заход пользователя на веб-страницу сайта, не зависимо от того, сколько разделов он в итоге посетит"
    },
    {
        "name": "Вики",
        "forms": "(или «википедия»)",
        "description": "общедоступная многоязычная универсальная интернет-энциклопедия со свободным контентом, созданная и поддерживаемая сообществом добровольных редакторов с использованием системы редактирования на основе wiki"
    },
    {
        "name": "Вилдкарды",
        "forms": "(от англ. «wildcard characters»)",
        "description": "так же их называют \"символы-джокеры\" или \"символы подстановки\" — символы, используемый для замены других символов или их последовательностей, тем самым приводя к символьным шаблонам. Другими словами, это некая переменная, которая служит \"заглушкой\" и обычно означает значение/строку, которая должна была быть на ее месте"
    },
    {
        "name": "Винда",
        "forms": "(или «виндоза», «виндоуз», «виндовоз», от англ. «windows»)",
        "description": "операционная система Windows, впервые созданная корпорацией Microsoft в 1985 году. Простыми словами, это главная программа, которая начинает работать после включения ПК и позволяет юзеру работать с файлами, использовать Интернет и запускать различные программы"
    },
    {
        "name": "Винт",
        "forms": "(или «веник», «винчестер», «жёсткий диск»)",
        "description": "накопитель на жёстких магнитных дисках - одно из самых важных составных частей любого ПК. Это запоминающее устройство для хранения/накопления данных на компьютере"
    },
    {
        "name": "Вирус",
        "forms": "(или «вирь»)",
        "description": "вид вредоносного ПО, которое способно незаконно встраиваться в написанный код различных программ, системные области памяти, загрузочные секторы и т.д., тем самым нанося вред. Основной целью вирусов является самораспространение по средствам различных каналов связи (обычно, при скачивании вредоносного файла из ненадежных источников)"
    },
    {
        "name": "Виснуть",
        "forms": "(или «вешаться»)",
        "description": "состояние, при котором компьютер или конкретная программа/приложение не отвечает на команды и запросы пользователя"
    },
    {
        "name": "Витуха",
        "forms": "(или «витя», «витюха», «витая пара»)",
        "description": "определенный вид кабеля связи (витая пара), представляющий собой изолированные пары скрученных между собой проводников в пластиковой оболочке"
    },
    {
        "name": "Войтивайти",
        "forms": "",
        "description": "«войти в IT»: шуточный термин, обозначающий процесс перепрофилирования специалиста, далёкого от сферы IT в разработчика"
    },
    {
        "name": "Ворд",
        "forms": "",
        "description": "текстовый редактор Microsoft Word, предназначенный для создания, просмотра, редактирования и форматирования текстовых файлов"
    },
    {
        "name": "Воркшоп",
        "forms": "(от англ. «workshop»)",
        "description": "мероприятие обучающего характера для специалистов из определённой сферы деятельности (программистов, фотографов, дизайнеров и т.д.). Обучение проводит обычно один из ведущих работников компании, вместе с которым участники совместно выполняют определенное задание/решают проблему"
    },
    {
        "name": "Выделенка",
        "forms": "",
        "description": "выделенная линия, т.е. подключение к интернет-провайдеру с использованием индивидуальной линии (кабеля) и сетевой карты"
    },
    {
        "name": "Выкатить",
        "forms": "",
        "description": "вывести приложение/программу/сайт в открытый доступ для всех пользователей"
    },
    {
        "name": "Выпадашка",
        "forms": "",
        "description": "элемент интерфейса ПО/приложения/сайта, сделанный по типу «выпадающего списка» («droplist»). Используется в тех случаях, когда необходимо что-то конкретизировать/детализировать, не перегружая при этом большим количеством информации главный экран"
    },
    {
        "name": "Гаджет",
        "forms": "(от англ. «gadget»)",
        "description": "небольшой электронный прибор/девайс, который предназначен для того, чтобы помогать человеку в его деятельности"
    },
    {
        "name": "Гайд",
        "forms": "(от англ. «guide»)",
        "description": "прописанная инструкция, руководство по достижению определенной цели, правила и порядок действий при выполнении поставленной задачи"
    },
    {
        "name": "Гамать ",
        "forms": "(или «геймить», от англ. «to game»)",
        "description": " играть"
    },
    {
        "name": "Геймдев",
        "forms": "(от англ. «game development»)",
        "description": "процесс разработки игр под определенную платформу"
    },
    {
        "name": "Геймер",
        "forms": "(от англ. «gamer»)",
        "description": "человек, проводящий время в игре"
    },
    {
        "name": "Геймпад",
        "forms": "(от англ. «gamepad»)",
        "description": "игровой пульт, тип игрового манипуляторы. В отличии от джойстика, удерживается одной рукой, а для нажатия используются большие пальцы рук (в современных геймпадах также часто используются указательный и средний пальцы)"
    },
    {
        "name": "Геймплей",
        "forms": "(от англ. «gameplay»)",
        "description": "игровой процесс, сюжет игры, описывающий, порядок взаимодействия игрока с игровым миром, то, как он реагирует на действия игрока и как определяется набор действий, который предлагает игроку игра"
    },
    {
        "name": "Гейт",
        "forms": "(от англ. «gate»)",
        "description": "1) сетевой шлюз, устройство/ПО, которое сопрягает разнородные компьютерные сети; 2) электронное устройство или плагин динамической обработки, предназначенный для контроля уровня звукового сигнала (он пропускает сигнал выше установленного уровня и не пропускает сигнал ниже этого уровня)"
    },
    {
        "name": "Гектар",
        "forms": "(или «гиг»)",
        "description": "другое название гигабайта (кратен единице байта) - единица измерения количественной информации, равная 109 (1 000 000 000) или 230 (1 073 741 824) байт"
    },
    {
        "name": "Генерить",
        "forms": "(или «сгенерить», от англ. «generate»)",
        "description": "сгенерировать, создать что-то новое, сформировать что-либо. Часто применяется по отношению к новым идеям и вариантам"
    },
    {
        "name": "Гестуры",
        "forms": "(от англ. «gestures»)",
        "description": " определенные движения по экрану пальца или стилуса, которые позволяют заменить те или иные команды или их последовательности. Это существенно ускоряет и упрощает работу на мобильных устройствах"
    },
    {
        "name": "Гик",
        "forms": "(от англ. «geek»)",
        "description": "индивид, хорошо разбирающийся в каком-либо направлении деятельности и являющийся фанатом своего дела. Сейчас под гиками довольно часто подразумевают айтишников/программистов"
    },
    {
        "name": "Гит",
        "forms": "",
        "description": "1) система контроля и управления версиями Git, консольная утилита для отслеживания и ведения истории изменения файлов в проекте; 2) веб-сервис GitHub для хостинга IT-проектов и совместной работы над ними"
    },
    {
        "name": "Гитхаб",
        "forms": "(от англ. «GitHub»)",
        "description": "крупный веб-сервис для хранения (хостинга) репозиториев IT-проектов и совместной работы над ними. GitHub является своеобразной соц. сетью для программистов, которая позволяет им ознакомится с кодом друг друга, прокомментировать его и помочь в разработке"
    },
    {
        "name": "Гифка",
        "forms": "(или «гифчик», «гиф»)",
        "description": "растровый графический файл в формате GIF, анимированное цифровое изображение, состоящее из небольшого количества кадров (фреймов), бесконечно сменяющих друг-друга, создавая тем самым некий сюжет/ небольшой мультфильм"
    },
    {
        "name": "Глаз",
        "forms": "",
        "description": "помимо обычного значения, в it-сфере так называют монитор компьютера -устройство, отображающее видео и графическую информацию, которую генерирует видеокарта"
    },
    {
        "name": "Глобальные переменные",
        "forms": "",
        "description": "переменные, объявленные вне блока. Они создаются при запуске программы и уничтожаются после её завершения. Их можно использовать в любом месте файла, после их объявления"
    },
    {
        "name": "Глюк",
        "forms": "",
        "description": "случайная редкая ошибка в программе, вызванная неправильно написанным кодом, либо работой каких-либо сторонних программ"
    },
    {
        "name": "Гмыл",
        "forms": "(или «джимейл», «жимейл»)",
        "description": "имеется ввиду почтовый сервис Gmail от Google или непосредственно сам почтовый ящик на gmail.com"
    },
    {
        "name": "Грызун",
        "forms": "",
        "description": "компьютерная мышь, специальное устройство для управления курсором и передачи определенных команд ПК"
    },
    {
        "name": "Гуглить",
        "forms": "",
        "description": "искать информацию в поисковой строке браузера. Изначально использовалось применительно только к поисковой системе Google, но теперь применяется и к остальным поисковиками"
    },
    {
        "name": "Гуй",
        "forms": "",
        "description": "(или «GUI», от англ. «Graphical User Interface») — графический интерфейс пользователя, состоящее из окон, разнообразных меню, кнопок и прочих виджетов"
    },
    {
        "name": "Гуру",
        "forms": "",
        "description": "в общем смысле употребляется как синоним слов: учитель, духовный наставник, уважаемый человек, профессионал, опытный мастер. В it-сфере гуру называют крутых программистов"
    },
    {
        "name": "Даблклик",
        "forms": "(от англ. «double click»)",
        "description": "— двойное нажатие"
    },
    {
        "name": "Даблтап",
        "forms": "(от англ. «double tap»)",
        "description": "— двойное короткое нажатие (тап) на выбранный элемент интерфейса сенсорного дисплея, сродни даблклику"
    },
    {
        "name": "Дамп",
        "forms": "(от англ. «dump»)",
        "description": "— файл, содержащий резервную копию системы/памяти компьютера/базы данных, актуальную на момент его создания. В разработке дампы применяют для создания и поддержания в актуальном состоянии системы бэкапа"
    },
    {
        "name": "Дата центр",
        "forms": "(или «ЦОД», от англ. «data center»)",
        "description": "— это специализированное здание для размещения и обслуживания серверного, сетевого оборудования"
    },
    {
        "name": "Даунлинк",
        "forms": "(от англ. «downlink»)",
        "description": "— нижестоящий линк, которому данный узел отдаёт почту"
    },
    {
        "name": "Даунлоад",
        "forms": "(от англ. «download»)",
        "description": " — процесс передачи (скачивания) файловых данных из одного устройства в другое"
    },
    {
        "name": "Даунлоадер",
        "forms": "(или «менеджер загрузок», от англ. «downloader»)",
        "description": " — программное обеспечение, предназначенное для загрузки/скачивания файлов"
    },
    {
        "name": "Движок",
        "forms": "(или «двигло») — прикладная часть программного кода (программа/часть программы/комплекс программ/библиотека)",
        "description": "выделенная для реализации определенной задачи"
    },
    {
        "name": "Двухголовый",
        "forms": "",
        "description": "в it имеется ввиду компьютер с двумя мониторами, либо двухъядерный процессор"
    },
    {
        "name": "Дебажить",
        "forms": "от англ. «debug», «debugging»)",
        "description": "( — производить поиск ошибок/багов в программе с последующим их исправлением"
    },
    {
        "name": "Девайс",
        "forms": "(или «девица», «дежице», от англ. «device»)",
        "description": " — любое полезное техническое устройство/приспособление, конструктивно законченная техническая система, имеющая определённое функциональное назначение (ноутбук/смартфон/планшет/умные часы и т.д.)."
    },
    {
        "name": "Девелопер",
        "forms": "(или «разработчик», от англ. «developer»)",
        "description": " — специалист, который непосредственно занимается разработкой ПО и приложений"
    },
    {
        "name": "Девелопмент",
        "forms": "(от англ. «development»)",
        "description": " — разработка чего-либо: сайтов, программного обеспечения, приложений, игр и т.д"
    },
    {
        "name": "Дед",
        "forms": "(или «голый дед», от англ. «GoldEd»)",
        "description": " — русифицированное произношение \"GoldED\" и \"GoldED+\": популярного редактора сообщений для Фидонет и совместимых сетей"
    },
    {
        "name": "Дедикейтед ",
        "forms": "(или «выделенный сервер», от англ. «dedicated»)",
        "description": " — хостинг с предоставлением клиенту реально существующей машины (в отличии от виртуального хостинга)"
    },
    {
        "name": "Дедлайн",
        "forms": "(от англ. «deadline»)",
        "description": " — крайний итоговый срок, к которому должна быть выполнена та или иная задача/сдан проект/достигнута цель"
    },
    {
        "name": "Декремент",
        "forms": "(от англ. «decrement»)",
        "description": " — уменьшение значения переменной на заданное значение (обычно, на единицу)"
    },
    {
        "name": "Делфи",
        "forms": "(от англ. «Delphi»)",
        "description": " — императивный, структурированный, объектно-ориентированный, высокоуровневый язык программирования со строгой статической типизацией переменных. В основном, используется для написание прикладного ПО"
    },
    {
        "name": "Демка ",
        "forms": "(или «демо», от англ. «demo», «demonstration»)",
        "description": " — 1) демонстрационная версия чего-либо (приложения, подписки, ПО), зачастую, с ограниченным функционалом или с коротким пробным периодом пользования; 2) жанр компьютерного искусства, заключающийся в создании мультимедийной презентации. Демки создаются в целях демонстрации возможностей и знаний в области программирования, компьютерной графики"
    },
    {
        "name": "Деплой",
        "forms": "(или «задеплоить», от англ. «deploy»)",
        "description": " — развёртывание (перенос/помещение) программного обеспечения (исполняемого кода) на выбранный сервер или конкретное устройство, где оно будет работать"
    },
    {
        "name": "Десктоп",
        "forms": "(или «дэсктоп», от англ. «desktop»)",
        "description": " — 1) тип корпуса системного блока компьютера, настольный компьютер, предназначенный для постоянного размещения на столе; 2) рабочий стол - вся площадь экрана при работе в операционной системе"
    },
    {
        "name": "Деструктор",
        "forms": "(от англ. «destructor»)",
        "description": " — это специальный тип метода класса, который выполняется при удалении объекта класса. Деструкторы созданы для деинициализации объекта (очистки памяти) после инициализации класса с помощью конструкторов"
    },
    {
        "name": "Дефолтный",
        "forms": "(или «по дефолту», от англ. «default»)",
        "description": " — значения, которые присваиваются параметрам автоматически («по умолчанию») в тех случаях, когда юзер не задал им ни одно из допустимых значений"
    },
    {
        "name": "Джаббер",
        "forms": "(или «Жаббер», от англ. «JABBER»)",
        "description": " — открытый протокол для быстрого обмена сообщениями ХМРР, а также собирательное название работающих с его использованием клиентских программ"
    },
    {
        "name": "Джава",
        "forms": "(или «жаба», «ява», от англ. «java»)",
        "description": " — язык программирования, который используется для написания приложений, работающих в под управлением веб-браузера, а также для мобильных устройств"
    },
    {
        "name": "Джаваскрипт",
        "forms": "(или «жабаскрипт», «яваскрипт», от англ. «JavaScript»)",
        "description": " — мультипарадигменный язык программирования, который поддерживает объектно-ориентированный, императивный и функциональный стили"
    },
    {
        "name": "Джампер",
        "forms": "(или «JP», от англ. «jumper pins»)",
        "description": " — 1) небольшой переключатель на материнской плате и других картах, на аппаратном уровне фиксирующий какой-либо параметр; 2) перемычка , которая дает возможность выставить режим работы устройства с помощью замыкания ( размыкания ) нескольких контактов"
    },
    {
        "name": "Джуниор",
        "forms": "(или «джун», «июнь», от англ. «Junior Developer»)",
        "description": " — общепринятое в it название младшего разработчика (начальный уровень программиста), специалиста без опыта или с минимальным опытом работы"
    },
    {
        "name": "Диалап",
        "forms": "(или «Коммутируемый доступ», от англ. «dial-up»)",
        "description": " — коммутированное удаленное соединение, подключение к провайдеру, используя модем и телефонную сеть общего пользования"
    },
    {
        "name": "Дидос",
        "forms": "(или «дидосить», «задидось», «ДДоС», от англ. «Distributed Denial of Service»)",
        "description": "  — массированная атака на сетевые ресурсы или каналы связи с помощью заражённых «третьих» компьютеров-зомби с целью сделать их недоступными для легитимных пользователей. DDoS-атаки заключаются в единовременной отправке ресурсу огромного количества запросов с одного или многих компьютеров, расположенных в сети Интернет"
    },
    {
        "name": "Динамическая библиотека",
        "forms": "(или «общая библиотека»)",
        "description": " — фактически исполняемый файл. Состоит из подпрограмм, которые подгружаются в вашу программу во время её выполнения (каждый раз в момент создания процесса). При компиляции программы, которая использует динамическую библиотеку, эта библиотека не становится частью вашего исполняемого файла — она ​​так и остается отдельным модулем"
    },
    {
        "name": "Динамический массив",
        "forms": "(от англ. «dynamic array»)",
        "description": "  — массив, который способен изменять свой размер ​​во время выполнения программы и дает возможность более гибкой работы с данными (позволяет не составлять прогноз объёмов данных, а регулировать размер в зависимости от требуемых объёмов)"
    },
    {
        "name": "Директ",
        "forms": "(от англ. «direct»)",
        "description": " — 1) Яндекс.Директ - сервис для продвижения товаров и услуг с помощью контекстной рекламы в поисковой системе Яндекса и у его партнеров; 2) отправка данных напрямую, в обход роутинга; 3) мессенджер внутри приложения Instagram, позволяющий пользователем обмениваться сообщениями"
    },
    {
        "name": "Директория",
        "forms": "(или «дира»)",
        "description": " — синоним слова «каталог», папка с какими-либо файлами на ПК"
    },
    {
        "name": "Диск",
        "forms": "",
        "description": "1) любой смонтированный в системе носитель информации, имеющий в названии «букву» (\"Диск С\", \"Диск D\"); 2) CD или DVD диск (оптический носитель информации, на котором процесс записи и считывания информации осуществляется с помощью лазера)"
    },
    {
        "name": "Дисконнект",
        "forms": "(или «отконнектиться», «расконнектиться», от англ. «disconnect»)",
        "description": " — временное отключение/разрыв/потеря связи или соединения"
    },
    {
        "name": "Дистр",
        "forms": "(или «Дистрибутив»)",
        "description": " — форма распространения программного обеспечения, установочный комплект файлов/ПО"
    },
    {
        "name": "Дистрибутив",
        "forms": "",
        "description": "форма распространения ПО, обычно дистрибутив содержит программу установщик с выбором режимов и параметров установки"
    },
    {
        "name": "Домен",
        "forms": "(или «доменное имя», «доменный адрес», от англ. «domain»)",
        "description": " — 1) уникальный онлайн адрес/имя сайта, место его размещения в Интернете. Например, science.involta.ru — это домен второго уровня, который состоит из доменного имени science.involta и домена первого уровня .ru; 2) часть фидонетовского адреса, которая содержит название глобальной сети (@fidonet.org)"
    },
    {
        "name": "ДоС",
        "forms": "(от англ. «Denial of Service»)",
        "description": " — отказ сервера в обслуживании, невозможность обработки информации из-за множества поступающих запросов"
    },
    {
        "name": "Драй",
        "forms": "(от англ. «DRY », «don’t repeat yourself»)",
        "description": " — в программировании принцип разработки ПО, предлагающий избегать повторений различной информации в коде (особенно в системах со множеством слоёв абстрагирования)"
    },
    {
        "name": "Драйвер",
        "forms": "(или «драйверА», «дрАйверы», «дрова», от англ. «driver»)",
        "description": "  — компьютерное ПО, с помощью которого другое ПО/ОС взаимодействует с аппаратным обеспечением, подключаемого устройства (наушники, принтер, колонки, видеокарта и т.д.)"
    },
    {
        "name": "Дропбокс",
        "forms": "(от англ. «Dropbox»)",
        "description": " — файловый хостинг. При установке ПО на компьютере создаётся синхронизируемая папка, которая дает возможность юзеру размещать свои файлы на удалённых серверах при помощи клиента или через веб-интерфейс браузера"
    },
    {
        "name": "Дроплист",
        "forms": "(или «выпадашка», «дропдаун», от англ. «drop list»)",
        "description": " — элемент графического интерфейса пользователя (выпадающий / раскрывающийся список), дающий возможность юзеру выбрать одно из нескольких существующих значений параметра"
    },
    {
        "name": "Дропнуть ",
        "forms": "(от англ. «drop»)",
        "description": " — в IT подразумевается обычно удаление чего-либо (базу данных, приложение, таблицу и т.д.)"
    },
    {
        "name": "Дыра",
        "forms": "(или «дырка»)",
        "description": " — \"уязвимое место\", возможность получить незаконный доступ к чему-либо (ПО, админке сайта и т.д.), которая не была предусмотрена разработчиками"
    },
    {
        "name": "Ебизнес",
        "forms": "(или «электронный бизнес», от англ. «e-Business»)",
        "description": "бизнес-модель, в которой бизнес-процессы, обмен информацией и коммерческие транзакции осуществляются с помощью информационных систем"
    },
    {
        "name": "Еггогология",
        "forms": "",
        "description": "изучение и использование скрытых, недокументированных возможностей микрокалькуляторов"
    },
    {
        "name": "Египетские скобки",
        "forms": "(или «{ }»)",
        "description": "стиль оформления кода в C-подобных языках, когда открывающие/закрывающие скобки ставятся в конце текущего ряда, это позволяет писать код более компактно"
    },
    {
        "name": "Еррор",
        "forms": "(или «Егор», «ЕГГОГ», от англ. «error»)",
        "description": "ошибка, образуется при выполнении недопустимых условий или операций"
    },
    {
        "name": "Железо ",
        "forms": "",
        "description": "материально-техническая часть/комплектующие компьютеров/ноутбуков/смартфонов и т.д."
    },
    {
        "name": "Железячник",
        "forms": "",
        "description": "человек, на постоянной основе интересующийся/следящий за появлением нового \"железа\" (т.е. комплектующих компьютерной техники), хорошо разбирающийся в нём"
    },
    {
        "name": "ЖЖ",
        "forms": "",
        "description": "(или «жижа», «жежешечка») — живой журнал, онлайн-дневник, который располагается на блог-платформе Livejournal.com"
    },
    {
        "name": "Жипег",
        "forms": "(жопег, жпег)",
        "description": "растровый графический формат файлов JPEG (JPG), использующийся для хранения фотографий и других граических изображений"
    },
    {
        "name": "Жмыл",
        "forms": "(или «жмыло», «жмель»)",
        "description": "популярный бесплатный почтовый сервис Gmail от Google, предоставляющий доступ к электронным почтовым ящикам"
    },
    {
        "name": "Жужунчик",
        "forms": "",
        "description": "флоппи-привод, дисковод, который предназначен для считывания и записи информации с дискет 3.5 дюйма\nЗ"
    },
    {
        "name": "Зааджастить",
        "forms": "(от англ. «to adjust»)",
        "description": "немного поменять логику программы, внести легкие изменения, до настроить, привести в порядок, отрегулировать"
    },
    {
        "name": "Заасайнить таск",
        "forms": "(от англ. «to assign», «task»)",
        "description": "значит «поручить задание». Обычно, используется в контексте распределения рабочих задач между специалистами в программе‑менеджере"
    },
    {
        "name": "Забанить",
        "forms": "(или «забабить», «забананить», «послать в баню», от англ. «ban»)",
        "description": "запретить доступ к выбранному ресурсу, лишить возможности пользователя отправлять сообщения на форуме или в чате"
    },
    {
        "name": "Забэкапить",
        "forms": "(от англ. «back up»)",
        "description": "сделать резервную копию чего-либо для последующего восстановления данных"
    },
    {
        "name": "Зависание",
        "forms": "",
        "description": "нерегламентированное состояние, при котором одна или несколько программ или вся ОС полностью не реагируют на команды юзера"
    },
    {
        "name": "Заголовочные файлы",
        "forms": "(или «заголовки», от англ. «header files»)",
        "description": "в программировании обозначает файл, механически «вставляемый» компилятором в исходный текст, в том месте, где располагается некоторая директива"
    },
    {
        "name": "Задрот",
        "forms": "",
        "description": "1) прозвище человека, слишком много времени уделяющего виртуальному миру (компьютерные игры, программирование и т.д.); 2) ярый фанатик своего дела, который сильно зациклен на нем (не зависимо от специальности), зачастую не очень приспособлены к реальной жизни"
    },
    {
        "name": "Зазиповать",
        "forms": "",
        "description": "перевести готовый архив с какими-то файлами в формат .zip"
    },
    {
        "name": "Законнектиться",
        "forms": " (или «подконнектиться», «приконнектиться», от англ. «connect»)",
        "description": "присоединиться к чему-либо, установить связь, наладить контакт"
    },
    {
        "name": "Залить",
        "forms": "",
        "description": "загрузить файлы на сервер/сайт или закачать информацию в базу данный/файлообменник"
    },
    {
        "name": "Залогиниться",
        "forms": "",
        "description": "войти в систему/программу в качестве зарегистрированного пользователя, с использованием определённого логина и пароля"
    },
    {
        "name": "Залочить",
        "forms": "(или «заблочить», от англ. «lock»)",
        "description": "установить блокировку на персональное устройство (ПК, смартфон, планшет) для защиты от несанкционированного доступа сторонних лиц"
    },
    {
        "name": "Запилить",
        "forms": "",
        "description": "создать/сделать/выложить что-либо, добавить какую-то функциональность"
    },
    {
        "name": "Заплатка",
        "forms": "(или «патч»)",
        "description": "дополнение или обновление, призванное исправить существующие ошибки/баги/глюки в системе или ПО. Процесс применения патча (заплатки) к программе называется пропатчиванием"
    },
    {
        "name": "Запостить",
        "forms": "(или «постить», от англ. «post»)",
        "description": "1) создать и выложить пост в социальной сети/блоге; 2) в сети Фидонет - посылать сообщения в эху"
    },
    {
        "name": "Зарарить",
        "forms": "",
        "description": "перевести готовый архив с какими-то файлами в формат .rar"
    },
    {
        "name": "Зарегать",
        "forms": "",
        "description": "произвести регистрацию чего-либо: учетной записи, программы, никнейма, канала, блога"
    },
    {
        "name": "Зарелизить",
        "forms": "(от англ. «to release»)",
        "description": "официально выпустить новую версию продукта, доступную для использования"
    },
    {
        "name": "Засейвить",
        "forms": "(от англ. «save»)",
        "description": "сохранить некую информацию/версию"
    },
    {
        "name": "Засерить",
        "forms": "",
        "description": "сделать выбранный элемент разрабатываемого интерфейса неактивным (обычно обозначается серым цветом)"
    },
    {
        "name": "Зафакапить",
        "forms": "(от англ. «fuck up»)",
        "description": "полностью провалить поставленную задачу, целиком испортить задание"
    },
    {
        "name": "Зафейлить",
        "forms": "(от англ. «fail»)",
        "description": "небольшой прокол, например, не уложиться в заявленное время, выполняя задачу"
    },
    {
        "name": "Звуковуха",
        "forms": "(или «звучка», «звуковая карта», «музыкальная плата»)",
        "description": "звуковая плата, позволяющая работать со звуками на ПК"
    },
    {
        "name": "Зловред",
        "forms": "",
        "description": "вредоносное ПО, обычно вирус или шпионская программа"
    },
    {
        "name": "Змея",
        "forms": "(или «питон», «пайтон», от англ. «Python»)",
        "description": "универсальный высокоуровневый скриптовый язык программирования, имеющий минималистичный синтаксис и направленный на повышение читаемости кода и увеличение производительности разработчика"
    },
    {
        "name": "Зомби",
        "forms": "",
        "description": "в it сфере так называют компьютеры, содержащие троянские программы"
    },
    {
        "name": "Ибешник",
        "forms": "",
        "description": "специалист отдела информационной безопасности, занимающийся обеспечением конфиденциальности и сохранности данных компании и отдельных пользователей"
    },
    {
        "name": "Игнор",
        "forms": "(от англ. «ignore»)",
        "description": "1) метка, которой один участник чата отмечает другого участника, при этом система игнорирует сообщения выбранного пользователя 2) простое игнорирование чьих-либо сообщений (не открывать/не читать/не отвечать"
    },
    {
        "name": "Идентификатор",
        "forms": "(от англ. «identifier»)",
        "description": "в языках программирования обозначает имя переменной/функции/класса или некого другого объекта"
    },
    {
        "name": "Иконка",
        "forms": "(или «значок», от англ. «icon»)",
        "description": "элемент графического интерфейса, маленькая картинка, которая обозначает приложение/файл/каталог/ устройство и т. п."
    },
    {
        "name": "ИК порт",
        "forms": "(или «инфракрасный порт», от англ. «IrDaA», «Infrared Data Association»)",
        "description": "устройство, которое позволяет установить беспроводное соединение с любым устройством, тоже имеющим ИК-порт и находящимся в прямой видимости от аппарата"
    },
    {
        "name": "Икспи",
        "forms": "(или «икспя», «хря», «хрюша», от англ. «XP»)",
        "description": "Windows XP, операционная система семейства Windows NT корпорации Microsoft"
    },
    {
        "name": "Иксы",
        "forms": "(от англ. «Х»)",
        "description": "так в разговорном языке называют стандарт X Window System, на котором, аналогично окошкам в ОС Windows, основана графическая оболочка в Linux-дистрибутивах"
    },
    {
        "name": "Имба",
        "forms": "(от англ. «imbalanced»)",
        "description": "несбалансированный элемент, персонаж или предмет в компьютерной игре. Обычно термин применяется в онлайн-играх по отношению к более сильному на фоне остальных игроку/персонажу"
    },
    {
        "name": "Имплементация",
        "forms": "(от англ. «implementation») ",
        "description": "в объектно-ориентированном программировании термин обозначает практическую реализацию методов"
    },
    {
        "name": "Имплементить",
        "forms": "(от англ. «to implement»)",
        "description": "реализовывать, исполнить намеченное"
    },
    {
        "name": "Имхо",
        "forms": "(от англ. «IMHO», «In My Humble Opinion»)",
        "description": "по моему скромному мнению. В русифицированной версии расшифровывается как: «Имею Мнение Хрен Оспоришь»"
    },
    {
        "name": "Индусский код ",
        "forms": "",
        "description": "код, который написан слишком длинно и \"кудряво\". Такое название связано с особенностями оплаты работы программистов в Индии: им платятза каждую строчку кода. Хитрые и прозорливые специалисты пользуются этим и прописывают лишние бесполезные строки"
    },
    {
        "name": "Инкапсуляция",
        "forms": "(от англ. «encapsulation»)",
        "description": "1) упаковка данных и/или функций в единый компонент; 2) процесс скрытого хранения деталей реализации объекта от пользователей/программистов) и предоставление им для работы интерфейсов классов"
    },
    {
        "name": "Инкремент",
        "forms": "(от англ. «increment»)",
        "description": "уменьшение значения переменной на заданное значение (обычно, на единицу)"
    },
    {
        "name": "Инсталлировать",
        "forms": "(от англ. «install»)",
        "description": "устанавливать некую программу/систему на ПК"
    },
    {
        "name": "Интегрированная среда разработки",
        "forms": "(от англ. «IDE», «Integrated Development Environment»)",
        "description": "это комплекс ПО, содержащего необходимые элементы для разработки, компиляции, линкинга и отладки кода"
    },
    {
        "name": "Интерактив",
        "forms": "",
        "description": "двухсторонняя связь с сервером"
    },
    {
        "name": "Интерпретатор",
        "forms": "(от англ. «Interpretation»)",
        "description": "ПО, напрямую выполняющее написанный код, перед этим не проводя его компиляцию (т.е. не переводя его в машинный код)"
    },
    {
        "name": "Интранет",
        "forms": "",
        "description": "сеть внутри организации, которая используют протокол TCP/IP; может быть подключена к Интернету или существовать автономно и полностью изолированно"
    },
    {
        "name": "Информационная Безопасность",
        "forms": " (или «ИБ», от англ. «Information Security», « InfoSec»)",
        "description": "практика сохранения и защиты информации от несанкционированного доступа, использования, раскрытия, искажения и редактирования"
    },
    {
        "name": "ИП",
        "forms": "(или «айпи», «айпишник», от англ. «ip», «Internet Protocol»)",
        "description": "1) протокол, обеспечивающий доставку пакетов, снабженных IP адресом; 2) группа из четырёх десятичных чисел, являющаяся уникальным адресом ПК или сайта в Сети"
    },
    {
        "name": "ИП динамический",
        "forms": "",
        "description": "временный адрес, который выдается компьютеру при присоединении к провайдеру только на время текущей сессии"
    },
    {
        "name": "ИП статический ",
        "forms": "",
        "description": "постоянный адрес, который закреплен провайдером за конкретным ПК/сайтом"
    },
    {
        "name": "Ирка",
        "forms": "",
        "description": "чат в системе IRC (Internet Relay Chat): протокол прикладного уровня, предназначенный для обмена сообщениями в режиме on-line. Обычно используется для группового общения, а также общения в личных сообщениях и обмена данными, в т.ч. файлами"
    },
    {
        "name": "Искалка",
        "forms": "(или «ищейка»)",
        "description": "компьютерная поисковая система, необходимая для удобного поиска необходимой информации (внутри устройства или в Сети)"
    },
    {
        "name": "Исходник",
        "forms": "",
        "description": "1) файлы, с исходный кодом приложения, или сам исходный код; 2) первоначальный исходный материал (текст), на основе которого создается что-то новое"
    },
    {
        "name": "Итератор",
        "forms": "(от англ. «iterator»)",
        "description": "интерфейс, предназначенный специально для перебора элементов контейнера (например, значений массива/символов в строке), обеспечивающий доступ к каждому из них во время перемещения (итеррирования) по элементам"
    },
    {
        "name": "Итерация",
        "forms": "(от англ. «iteration»)",
        "description": "повторение определенного действия/шага/этапа"
    },
    {
        "name": "Казнет",
        "forms": "",
        "description": "совокупность информационных технологий и инфраструктуры, обеспечивающих доступ к сети интернет, а также хостинг электронных ресурсов на территории Казахстана с присвоенным доменом первого уровня .kz"
    },
    {
        "name": "Камень",
        "forms": "(или «проц», «кристалл», «ЦП»)",
        "description": "центральный процессор, основная составная часть каждого компьютера, выполняет в системе роль своеобразной мини атс"
    },
    {
        "name": "Капс",
        "forms": "",
        "description": "стиль регистра с заглавными буквами (верхний регистр). Термин пошел от названия кнопки «CapsLock», которая позволяет писать в верхнем регистре без нажатия клавиши «Shift»"
    },
    {
        "name": "Капсить",
        "forms": "",
        "description": "писать сообщения капсом (заглавными буквами), часто воспринимается как грубость - кричать/повышать голос. Крайне не приветствуется на форумах и в чатах без особой нужды"
    },
    {
        "name": "Капча",
        "forms": "",
        "description": "картинка, предназначенная для проверки пользователя на предмет его реальности (не является ли он ботом). Капча используется с целью защиты от авто-регистраций и спам-ботов"
    },
    {
        "name": "Карбонка",
        "forms": "(от англ. «carbon copies»)",
        "description": "неформальное название специальной области, куда копируются личные письма из эхоконференций"
    },
    {
        "name": "Касперыч",
        "forms": " (или «каспер», «кашпировский», «кашперский»)",
        "description": "Антивирус Касперского (ПО, предоставляющее юзерам защиту от всевозможных компьютерных вирусов, троянов, шпионских программ, руткитов с помощью проактивной защиты, включающей компонент HIPS)"
    },
    {
        "name": "Кастомер",
        "forms": "(от англ. «customer»)",
        "description": "покупатель, клиент или заказчик компании, который приобретает товары/услуги"
    },
    {
        "name": "Каталог",
        "forms": "(или «директория», «справочник», «папка»)",
        "description": "объект в файловой системе, который упрощает хранение и упорядочивание файлов"
    },
    {
        "name": "Катюша",
        "forms": "",
        "description": "процессор AMD K6, разработанный компанией AMD в 1997 году"
    },
    {
        "name": "Качалка",
        "forms": "(от англ. «download manager»)",
        "description": "менеджер загрузок, программа, которая обеспечивает возможность загрузки выбранных файлов из Интернета или локальной сети"
    },
    {
        "name": "КБПС",
        "forms": "",
        "description": "обозначение скорости сетевого соединения или битрейта мультимедийного файла, равное килобиту в секунду"
    },
    {
        "name": "Квотинг",
        "forms": "",
        "description": "цитата, цитирование комментария/высказывания при интернет-общении. Иногда квотингом называют излишнее употребление цитат"
    },
    {
        "name": "Кейс",
        "forms": "",
        "description": "реальная ситуация/случай из практики, произошедшие с человеком. Сейчас обычно используется применительно к опыту и конкретным наработкам специалиста, подтвержденным цифрами и наглядными примерами"
    },
    {
        "name": "Киберсквоттинг",
        "forms": "",
        "description": "приобретение или перехват на аукционе привлекательных/звучных доменных имен (регистрация) для их последующей выгодной перепродажи"
    },
    {
        "name": "Кибибайт",
        "forms": "(или «КиБ», от англ. «KiB»)",
        "description": " единица, созданная в 1998 году для измерения количества информации. Равна 210 (1024) байт"
    },
    {
        "name": "Кило",
        "forms": "(или «кил»)",
        "description": "килобайт, единица измерения количества информации, равная 1024 байтам (иногда 1000 байтам)"
    },
    {
        "name": "Килобакс",
        "forms": "",
        "description": "единица счета денег, равная 1000 или 1024 долларам США. Принято использовать при расчете зарплат класса белых воротничков в Америки"
    },
    {
        "name": "Кирпич",
        "forms": "",
        "description": "неработающее мобильное устройство (например, смартфон). Есть связанное понятие - \"окирпичивание\": это ситуация, когда кто-то сломал/сделал неработоспособным устройство"
    },
    {
        "name": "Клава",
        "forms": "(или «рояль»)",
        "description": "клавиатура: устройство с комплектом клавиш, предназначенное для ввода/вывода данных и управления гаджетом, к которому оно подключено"
    },
    {
        "name": "Кладж",
        "forms": "",
        "description": "управляющие строки, которые содержат техническую информацию о письме, скрытую по умолчанию при просмотре в редакторе"
    },
    {
        "name": "Клик",
        "forms": "",
        "description": " имеет несколько значений: 1) щелчок - характерный звук нажатия клавиши на клавиатуре механического типа; 2) одиночное разовое нажатие кнопки мыши; 3) событие, которое возникает при нажатии кнопки мыши; 4) переход на сайт при нажатии на выбранную ссылку"
    },
    {
        "name": "Клон",
        "forms": "",
        "description": "1) точная копия электронного устройства от популярного бренда, произведенная малоизвестным производителем; 2) копия сайта/платформы в Сети Интернет, созданная обычно для мошеннических действий"
    },
    {
        "name": "Кнопка",
        "forms": "",
        "description": "1) элемент интерфейса программы/сайта/приложения, созданный по аналогии с кнопками в технике (изображается в схожей стилистике и выполняет аналогичные функции); 2) любая клавиша на клавиатуре; 3) (кнопа) кнопка мыши"
    },
    {
        "name": "Ковёр",
        "forms": "",
        "description": "в компьютерной сфере так называют коврик для мыши"
    },
    {
        "name": "Коворкинг",
        "forms": "",
        "description": "современное арендованное помещение открытого типа, предназначенное для удобной и комфортной работы специалистов различных сфер деятельности, фрилансеров"
    },
    {
        "name": "Код",
        "forms": "",
        "description": "1) последовательность определенных команд (слов/символов) на каком-либо языке программирования; 2) ПО (исходный HTML код) сайта"
    },
    {
        "name": "Кодер",
        "forms": "",
        "description": "обычно так называют программистов, которые занимаются непосредственно написанием программного кода"
    },
    {
        "name": "Кодить",
        "forms": "",
        "description": "заниматься программированием, т.е. реализацией задуманного алгоритма в виде кода разрабатываемого продукта"
    },
    {
        "name": "Код-ревью",
        "forms": "",
        "description": "аудит/проверка разработанного кода с целью нахождения и исправления ошибок, незамеченных при его написании"
    },
    {
        "name": "Колокейшн",
        "forms": "",
        "description": "услуга по размещению собственного физического сервера на чужой точке (специальная площадка в дата-центр)"
    },
    {
        "name": "Комбобокс",
        "forms": "",
        "description": "поле с комбинированным списком – элемент графического интерфейса юзера, сочетающий в себе выпадающий список и однострочное текстовое поле для ввода значения вручную"
    },
    {
        "name": "Коммит",
        "forms": "",
        "description": "запись индексированных изменений в хранилище (репозиторий), содержащая данные об изменениях, комментарий и имя автора"
    },
    {
        "name": "Коммитить",
        "forms": "",
        "description": "проводить сохранение/фиксацию произведенных изменений кода в хранилище кода (репозиторий)"
    },
    {
        "name": "Коммуняка",
        "forms": "",
        "description": "коммуникатор (прародитель современного смартфона), представляющий собой гибрид телефона и карманного компьютера"
    },
    {
        "name": "Компилить",
        "forms": "",
        "description": "осуществлять компиляцию, т.е. перевод написанного кода с языка программирования на машинный язык"
    },
    {
        "name": "Компилятор",
        "forms": "",
        "description": "программа, выполняющая компиляцию (перевод написанного кода с языка программирования на машинный язык)"
    },
    {
        "name": "Компиляция",
        "forms": "",
        "description": "конвертация (перевод) кода, который был написан на высокоуровневом языке программирования, в исполняемую программу, позволяющую машине понять его напрямую"
    },
    {
        "name": "Комплейн",
        "forms": "",
        "description": "выражение недовольства/официальная жалоба координатору проекта"
    },
    {
        "name": "Комьюнити",
        "forms": "",
        "description": "1) ограниченное сообщество/группа людей, которые являются пользователями одного и того же сетевого ресурса/сообщества/приложения; 2) группа разработчиков и других специалистов, работающих над одним проектом или несколькими продуктами одной компании"
    },
    {
        "name": "Коннект",
        "forms": "",
        "description": "в широком смысле это установленная связь между объектами. Если рассматривать применительно к it, то коннект - это обеспечение связи между удаленными компьютерами"
    },
    {
        "name": "Константа",
        "forms": "",
        "description": "это переменная, значение которой не поддается изменению"
    },
    {
        "name": "Контент",
        "forms": "",
        "description": "содержательное наполнение сайта/соц.сети/блога (текстовки, изображения, аудио и видео файлы), поддающееся простому редактированию через админ-панель"
    },
    {
        "name": "Конфа",
        "forms": "",
        "description": ") сокращенное название конференции: общение между группой людей (реальное собрание или удаленное по средствам интернет - соединения); 2) конфигурационный файл ПО, позволяющий изменять его настройки"
    },
    {
        "name": "Конфиг",
        "forms": "",
        "description": "текстовый конфигурационный файл, который используется для хранения директивы настроек системы/команды загрузки драйверов"
    },
    {
        "name": "Копипаст",
        "forms": "",
        "description": "команды \"скопировать\" и \"вставить\". Иногда так иронично называют псевдо-творческую деятельность, сводящуюся лишь к копированию уже существующей информации (человек-копипастер)"
    },
    {
        "name": "Кора дуба",
        "forms": "",
        "description": "64-разрядный микропроцессор Intel Core 2 Duo, основанный на микроархитектуре Core, созданный для клиентских систем"
    },
    {
        "name": "Корень",
        "forms": "",
        "description": "1) корневая директория на диске: папка/каталог, являющаяся вышестоящей одновременно для всех существующих файлов и подпапок на устройстве; 2) root - аккаунт сисадмина в UNIX-подобных системах с полными правами"
    },
    {
        "name": "Корневой доступ",
        "forms": "",
        "description": "полноценный доступ ко всем данным и управлению компьютером/машиной UNIX"
    },
    {
        "name": "Корэл",
        "forms": "(или «корел», «корелдров», «король дров», «корявые дрова»)",
        "description": "графический редактор CorelDraw для работы с векторными изображениями"
    },
    {
        "name": "Костыль",
        "forms": "",
        "description": "наскоро реализованное решение проблемы в готовом коде. Является временной мерой, поддерживающей работоспособность программы, пока программисты трудятся над качественным глобальным решением"
    },
    {
        "name": "Котёнок",
        "forms": "",
        "description": "в Фидонете: неформальное название мейлера KittenMail"
    },
    {
        "name": "Кракер",
        "forms": "(или «крэкер», «крякер»)",
        "description": "опытный программист, который пишет кряки для взлома программной системы защиты (иногда их ошибочно путают с хакерами)"
    },
    {
        "name": "Кракозябры",
        "forms": "",
        "description": "набор случайных/непонятных символов, которые не поддаются расшифровки (РџСЂРёРІРµС‚! РњРµРЅСЏ). Обычно возникают на сайте при неправильной кодировке"
    },
    {
        "name": "Красная Шапочка",
        "forms": "",
        "description": "операционная система Linux Red Hat: дистрибутив Linux, который выпускался в период с 1995 по 2003 год включительно"
    },
    {
        "name": "Красный глаз",
        "forms": "",
        "description": "инфракрасный порт, передатчик данных, работающий в инфракрасном диапазоне"
    },
    {
        "name": "Кресты",
        "forms": "(или «си-плюс-плюс», «плюс», «ссы»",
        "description": "язык программирования С++, широко используемый для разработки ПО, ОС, серверов, игр"
    },
    {
        "name": "Кроссплатформенный",
        "forms": "",
        "description": "ПО/сайт, который способен работать на нескольких аппаратных платформах и ОС"
    },
    {
        "name": "Крыса",
        "forms": "",
        "description": " манипулятор типа «мышь» советсткого производства, отличающаяся от современных огромными размерами (примерно, с утюг)"
    },
    {
        "name": "Крысодром",
        "forms": "",
        "description": "коврик для манипулятора \"мышь/крыса\""
    },
    {
        "name": "Крэш-полл",
        "forms": "",
        "description": "1) непрерывная частая прозвонка на ноду, игнорирующая флаг времени работы ноды; 2) телефонное хулиганство"
    },
    {
        "name": "Кряк",
        "forms": "",
        "description": "специальная программа или дополнение для взлома платного ПО, делающее возможным его бесплатное использование"
    },
    {
        "name": "Крякнуть",
        "forms": "",
        "description": "взломать платное ПО с целью его дальнейшего бесплатного использования"
    },
    {
        "name": "Ксерить",
        "forms": "",
        "description": "снимать копию бумажных документов с помощью ксерокса (копировального аппарата)"
    },
    {
        "name": "Ксерокс",
        "forms": "",
        "description": "копировальный аппарат для создания ч/б или цветных копий бумажной документации. Является именем нарицательным для всех копировальных машин, хотя раньше обозначало лишь аппарат фирмы Xerox"
    },
    {
        "name": "Ку",
        "forms": "",
        "description": "приветствие в чате/мессенджере, побуждающее начать разговор. Произошло от приветствия в фильме Кин-Дза-Дза"
    },
    {
        "name": "Кубизм",
        "forms": "",
        "description": "философия создания интернет-ресурсов, в соответствии с которой пользователь является и создателем, и потребителем контента"
    },
    {
        "name": "Куки",
        "forms": "",
        "description": "небольшой файл текстового формата, который сайт посылает на диск пользователя для его идентификации и сохранения настроек"
    },
    {
        "name": "Кулер",
        "forms": "",
        "description": "система охлаждения, состоящая из вентилятора + радиатора, предназначенная для защиты от перегрева процессора, видеокарты, блока питания или прочих устройств"
    },
    {
        "name": "Кулхацкер",
        "forms": "",
        "description": " человек, который считает себя куртым программистом/хакером, хотя, на самом деле, таким не является"
    },
    {
        "name": "Кэмэдэ",
        "forms": "",
        "description": "разновидность текстового интерфейса. Одна из возможностей ОС, позволяющая вводить команды MS-DOS и других компьютерные команды"
    },
    {
        "name": "Кэмэдэшник",
        "forms": "",
        "description": "пакетный файл семейства ОС Windows NT, имеющий расширение .cmd"
    },
    {
        "name": "Лаг",
        "forms": "(или «лаги», «лагать», от англ. «lag»)",
        "description": " — торможение или медленная работа какой-либо системы, к примеру, программы или компьютерной игры. Возникает по причине недостаточных характеристик устройства, либо из-за низкой скорости интернета (если речь о передаче данных по сети)"
    },
    {
        "name": "Лайфхак",
        "forms": "(от англ. «lifehack»)",
        "description": " — «хитрости жизни», «народная мудрость», т.е. полезный совет, который помогает решить какую-то проблему/задачу с экономией времени/усилий"
    },
    {
        "name": "Ламер",
        "forms": "(или «ламо», от англ. «lamer») ",
        "description": "— 1) неопытный пользователь, человек, не разбирающийся в чём-либо, но при этом думающий, что все знает, «воинствующий» чайник; 2) среди пиратов, кракеров и фрикеров: слово синоним “лузера”, “пиявка”- тот, кто скачивает много файлов, ничего не давая взамен"
    },
    {
        "name": "Лапша",
        "forms": "",
        "description": "множество проводов, кабелей - обычно телефонных"
    },
    {
        "name": "Левел",
        "forms": "(от англ. «level»)",
        "description": " — в геймерской среде означает уровень, который достиг игрок, либо характеристику его успешности. В широком употреблении может означать степень успешности/навыков/способностей"
    },
    {
        "name": "Легаси-код",
        "forms": "(от англ. «legacy code»)",
        "description": " — изживший себя код, который был написан кем-то очень давно и с которым программистам теперь приходится работать"
    },
    {
        "name": "Лейбл",
        "forms": "(или «лейба», от англ. «label»)",
        "description": " — отличительный знак/наклейка на любом товаре/it-продукте, на которой указаны марка производителя, название, дата производства и т.д."
    },
    {
        "name": "Лечить",
        "forms": "",
        "description": "1) проверять и спасать компьютер от вирусный программ; 2) фиксить (исправлять) баги, обычно самым наипростейшим способом, по принципу временного латания дыр; 3) применять лекарство (кряк) к платной программе"
    },
    {
        "name": "Либа",
        "forms": "(от англ. «Library»)",
        "description": " — в программировании имеется ввиду библиотека кода или DLL в Windows"
    },
    {
        "name": "Ликбез",
        "forms": "",
        "description": "расшифровывается как \"ликвидация безграмотности\", т.е. обучение неким азам, фундаментальным основам"
    },
    {
        "name": "Линк",
        "forms": "(или «ссылка», «связь», «гиперссылка», от англ. «link»)",
        "description": " — 1) гипертекстовая ссылка на какой-либо сайт/ресурс/документ/урл (URL); 2) единица измерения, ранее бывшая в употреблении в америке, равная 20,11 см"
    },
    {
        "name": "Линкануть",
        "forms": "(от англ. «link»)",
        "description": " — отправить кому-то необходимую ссылку на какой-либо ресурс"
    },
    {
        "name": "Линкинг",
        "forms": "(от англ. «linking»)",
        "description": " — процесс связывания всех объектных файлов, которые генерирует компилятор, в единую программу с возможностью последующего запуска/выполнения с помощью линкера/компоновщика"
    },
    {
        "name": "Линтер",
        "forms": "",
        "description": "собирательное название программ, анализирующих написанный код и предупреждающих программиста об обнаруженных ошибках"
    },
    {
        "name": "Линукс",
        "forms": "(от англ. «Linux»)",
        "description": " — бесплатная, полностью готовая ОС на основе ядра Linux. Исходные коды Linux доступны для изменений и просмотров любым юзером"
    },
    {
        "name": "Линуксоид",
        "forms": "(от англ. «linux»)",
        "description": "  — человек/юзер, пользующийся ОС Linux (Линукс)"
    },
    {
        "name": "Лиса",
        "forms": "(или «лисичка»)",
        "description": "свободный браузер Mozilla Firefox с открытым исходным кодом, основанный в 2003 году"
    },
    {
        "name": "Лист",
        "forms": "(от англ. «List»)",
        "description": " — изменяемый список, структура данных для хранения объектов различных типов, построенная на двусвязных списках"
    },
    {
        "name": "Литерал",
        "forms": "",
        "description": "константа, фиксированное значение, записанное непосредственно в исходном коде программы, которые, в последствии, нельзя изменить"
    },
    {
        "name": "Лицуха",
        "forms": "(от лат. liсentia - «право»)",
        "description": " - лицензия/разрешение на выполнение некоторых действий, подтвержденное определенным документом. В мире it обычно имеется ввиду лицензия на ПО, дающая право на его использование"
    },
    {
        "name": "Личка",
        "forms": "(или «ЛС», «л/с», «приватный чат»)",
        "description": " — личные сообщения: форма общения в Интернет-пространстве между двумя людьми, суть которой заключается в приватности диалога "
    },
    {
        "name": "Личер",
        "forms": "(от англ. «leech»)",
        "description": "— пользователь файлообменной сети, который пользуется ресурсами других и лишь скачивает файлы, ничего не загружая взамен"
    },
    {
        "name": "Логин",
        "forms": "(или «ушка», от англ. «login»)",
        "description": " — имя учётной записи пользователя на ресурсе/ в ПО, используемое для авторизации (входа в систему)"
    },
    {
        "name": "Логиниться",
        "forms": "(или «залогиниться», от англ. «login»)",
        "description": " — процесс входа в систему (авторизация в ПО, на сайте) под ранее зарегистрированной учетной записью путём ввода логина и пароля"
    },
    {
        "name": "Лого",
        "forms": "(от англ. «logo»)",
        "description": " — логотип: уникальный графический элемент (эмблема), используемый компаниями/брендами для идентификации себя на рынке"
    },
    {
        "name": "Логофф",
        "forms": "(от англ. «logoff»)",
        "description": " — выход из системы (действие, противоположное авторизации), переход в режим незарегистрированного использователя ПО/сайта"
    },
    {
        "name": "Лог-файл",
        "forms": "(или «лог», от англ. «log file»)",
        "description": "  — текстовый файл (файл или таблица в базе данных) для внесения в последовательном порядке всех совершенных действия в ПО/сервере, к примеру: шаги юзеров, время произошедших ошибок и сбоев и тд."
    },
    {
        "name": "Локализовать",
        "forms": "(от англ. «localization»)",
        "description": " — перевести ПО/ресурс на местный язык пользователей с помощью ANSI (локальной кодовой страницы)"
    },
    {
        "name": "Локализовать багу",
        "forms": "",
        "description": "процесс \"расследования\" произошедшего бага (ошибки): поиск ее в коде, выяснение причины произошедшего, изучение последствий"
    },
    {
        "name": "Локаль",
        "forms": "(или «лан», «лана», «ланка», «лань», от англ. «locale»)",
        "description": " — 1) локальная кодовая страница (ANSI) с региональными настройками, некий стандарт, определяющий некоторые параметры: язык, часовой пояс и т.д."
    },
    {
        "name": "Локейшн",
        "forms": "(от англ. «location»)",
        "description": " — месторасположение (в it обычно применяется к геолокации юзера, либо месту хранения файла)"
    },
    {
        "name": "Лэптоп",
        "forms": "(от англ. «laptop»)",
        "description": " — собирательное название портативных ПК: ноутбуков, нетбуков, смартбуков, планшетов и т.д."
    },
    {
        "name": "Маздай",
        "forms": "(или «мастдай», от англ. «must die»)",
        "description": " — оперативная система Windows (от популярного выражения «Windows 95 must die»)"
    },
    {
        "name": "Мазила",
        "forms": "(или «мазилла», от англ. «Mozilla»)",
        "description": " — свободный браузер Mozilla Firefox на движке Quantum, разработанный Mozilla Corporation"
    },
    {
        "name": "Майнинг",
        "forms": "(от англ. «mining»)",
        "description": " — сейчас ассоциируется, в основном, с добычей криптовалюты с помощью мощных компьютеров, выполняющих сложные математические операции"
    },
    {
        "name": "Макрос",
        "forms": "(или «макрокоманда», «макроопределение», от англ. «makros»)",
        "description": " — 1) программный алгоритм действий, написанный пользователем (обычно применяются для выполнения рутинных действий); 2) символьное имя в шаблонах, заменяемое при обработке препроцессором на последовательность символов"
    },
    {
        "name": "Малварь",
        "forms": "(от англ. «malicious software»)",
        "description": " — вредоносное программное обеспечение, созданное с целью нанести урон пользователю или компьютеру с его содержимым"
    },
    {
        "name": "Манагер",
        "forms": "(от англ. «manager»)",
        "description": " — 1) менеджер, руководитель компании/отделения/проекта; 2) иногда, манагером пренебрежительно называют бездарного руководителя, которые не умеет принимать решения и нести ответственность"
    },
    {
        "name": "Мануал",
        "forms": "(от англ. «manual»)",
        "description": " — краткое руководство пользователя, инструкция по использованию чего-то: ПО, оборудования, сервиса и т.д."
    },
    {
        "name": "Массив",
        "forms": "(от англ. «array»)",
        "description": " — это совокупный тип данных, позволяющий посредством использования единого идентификатора заиметь доступ ко всем переменным одного и того же типа данных"
    },
    {
        "name": "Мейл",
        "forms": "(или «майл», от англ. «E-mail»)",
        "description": " — 1) электронное письмо/сообщение; 2) иногда \"мейлом\" называют конкретную почтовую службу Mail.Ru"
    },
    {
        "name": "Мастер",
        "forms": "(или «хозяин»)",
        "description": " — компьютер, который управляет трояном на \"зомби\" (на зараженном ПК), некоторые мастера способны удаленно управлять в ботнетах огромным количеством \"зомби\", организуя атаки ДДоС"
    },
    {
        "name": "Мейнстрим",
        "forms": "(от англ. «mainstream»)",
        "description": " — направление/течение, которое в определенное время является популярным и преобладает в какой-либо сфере общественной жизни: научной, культурной, технической и т.д."
    },
    {
        "name": "Мелкомягкие",
        "forms": "(или «мелкософт», «микромягкие», от англ. «microsoft»)",
        "description": " — компания Microsoft и все продукты, которые она выпускает"
    },
    {
        "name": "Ментор",
        "forms": "(от англ. «mentor»)",
        "description": " — наставник/учитель, опытный руководитель, который является носителем ценных знаний и умений"
    },
    {
        "name": "Меншить",
        "forms": "(от англ. «mention»)",
        "description": " — упоминание имени другого пользователя в чатах/группах/соц. сетях c целью привлечь его внимание к диалогу или же предоставить прямую ссылку на него для удобства поиска другими участниками беседы"
    },
    {
        "name": "Меню",
        "forms": "(от англ. «menu»)",
        "description": " — определенный набор/список команд в приложении/ПО/на сайте, с помощью которых можно выполнять необходимые операции"
    },
    {
        "name": "Мёржить",
        "forms": "(от англ. «Merge»)",
        "description": " — производить объединение/слияние нескольких веток кода или данных таблиц"
    },
    {
        "name": "Мессага",
        "forms": "(или «мессачь», «мессадж», от англ. «message»)",
        "description": " — сообщение/письмо в интернет-пространстве (на эл. почте, в чате, ICQ и т.д.)"
    },
    {
        "name": "Метр",
        "forms": "(или «мег», «МБ»)",
        "description": " — вариант названия единицы измерения информации, равной 1 мегабайту"
    },
    {
        "name": "Мидл",
        "forms": "(от англ. «Middle Developer»)",
        "description": " — средний уровень навыков/знаний программиста в общепринятой системе измерения (джуниор/мидл/сеньор)"
    },
    {
        "name": "Мировая паутина",
        "forms": "(от англ. «World Wide Web», «WWW»)",
        "description": " — объединенная система всех ресурсов сети Интернет, которые используют протокол HTTP («протокол передачи гипертекста»)"
    },
    {
        "name": "Митап",
        "forms": "(от англ. «meetup»)",
        "description": " — сходка/встреча специалистов из одной или близких сфер работы для взаимного обмена накопленным опытом, а иногда просто для неформального общения"
    },
    {
        "name": "Митинг",
        "forms": "(от англ. «meeting»)",
        "description": "  — в it-сфере термин употребляется применительно к собраниям/встречам, на которых обсуждаются итоги в проведенной работы, выявляются сложности и недоработки, ставятся новые цели и задачи"
    },
    {
        "name": "Модем",
        "forms": "(от англ. «modem»)",
        "description": " — устройство, которое осуществляет модуляцию (изменение характеристик в соответствии с изменениями входного информационного сигнала) и демодуляцию (обратный процесс при приёме данных из канала связи)"
    },
    {
        "name": "Модемный пул",
        "forms": "(от англ. «modem pool»)",
        "description": " — совокупность всех модемов интернет-провайдера, которые конструктивно и логически объединены меду собой и служат для обеспечения абонентов доступом к сети Интернет"
    },
    {
        "name": "Модератор",
        "forms": "(или «модер», от англ. «moderator»)",
        "description": "  — пользователь ресурса, который имеет более узкие права, чем администратор. В его функции входит следить за фактами нарушений правил (в конференции, на форуме) и пресекать их с помощью предупреждений, бана и т.д."
    },
    {
        "name": "Модераториал",
        "forms": "(от англ. «moderator»)",
        "description": " — в фидонете так называется «санкция» от модератора. Обычно это: предупреждение [*], строгое предупреждение [+], выговор с занесением [!] и ридонли (запрет писать сообщения) [r/o]"
    },
    {
        "name": "Моник",
        "forms": "(или «моня», от англ. «monitor»)",
        "description": " — монитор, устройство вывода визуальной информации с компьютера"
    },
    {
        "name": "Мониторить",
        "forms": "(от англ. «monitor»)",
        "description": " — просматривать и собирать необходимую информацию в открытых источниках, наблюдение/отслеживание чего-либо"
    },
    {
        "name": "Муар",
        "forms": "(от фр. moire)",
        "description": "  — некий \"рисунок\"/узор, который возникает при наложении двух периодических сетчатых рисунков (часто наблюдается при сканировании, растрировании изображений)"
    },
    {
        "name": "Мулька",
        "forms": "",
        "description": "1) полезная фича, какая-то \"изюминка\" в ПО/приложении, скрытая доп. функция; 2) этикетка, ярлычок, фирменный лого (обычно на одежде)"
    },
    {
        "name": "Мультикаст",
        "forms": "(от англ. «multicast»)",
        "description": " — передача информации сразу всей группе нуждающихся в ней получателей"
    },
    {
        "name": "Мылить",
        "forms": "(или «намыливать», от англ. «e-mail»)",
        "description": " — имеется ввиду процесс отправки сообщений по электронной почте"
    },
    {
        "name": "Мыло",
        "forms": "(или «емейл», «мейл», «имейл», от англ. «e-mail»)",
        "description": " — индивидуальный адрес электронной почты пользователя"
    },
    {
        "name": "Мыльница",
        "forms": "(от англ. «e-mail»)",
        "description": " — почтовая программа по обмену электронными письмами, т.е. почтовый ящик"
    },
    {
        "name": "Мыша",
        "forms": "(или «мышка», «мышь»)",
        "description": " — манипулятор/устройство для координации работы курсора и передачи необходимых команд ПК"
    },
    {
        "name": "Мышкодром",
        "forms": "",
        "description": "коврик для мыши, поверхность для удобной работы с манипулятором типа \"мышь\""
    },
    {
        "name": "Мэйлер",
        "forms": "(или «мейлер», «мылер», от англ. «mailer»)",
        "description": " — программа, обеспечивающая отправку и прием почты"
    },
    {
        "name": "Навбар",
        "forms": "(или «мейлер», «мылер», от англ. «mailer»)",
        "description": " — программа, обеспечивающая отправку и прием почты"
    },
    {
        "name": "Накатить",
        "forms": "",
        "description": "внести изменения, развернуть, опубликовать новую рабочую версию приложения. Противоположное термину «откатить»"
    },
    {
        "name": "Накрутка",
        "forms": "",
        "description": "целенаправленные действия с целью увеличения каких-либо показателей (например, лайков, репостов или подписчиков)"
    },
    {
        "name": "Наладонник",
        "forms": "(или «карманник», «КПК»)",
        "description": " — карманный персональный компьютер, прародитель современных коммуникаторов и смартфонов"
    },
    {
        "name": "Нативный",
        "forms": "(от англ. «native»)",
        "description": " — часто используют в словосочетании \"нативный код\", что обозначает исходный код, написанный разработчиками, который не модифицировался позже"
    },
    {
        "name": "Нетбиос",
        "forms": "(от англ. «NetBIOS»)",
        "description": " — протокол Microsoft Windows для работы и коммуникации ПК в сетях локального типа"
    },
    {
        "name": "Нетворкинг",
        "forms": "(от англ. «networking»)",
        "description": " — среда/круг профессионалов определённого направления, в котором, посредством общения, можно решить определенные задачи и проблемы, а так же завести полезные знакомства"
    },
    {
        "name": "Нетмейл",
        "forms": "(или «нетмайл», от англ. «NetMail»)",
        "description": " — в фидонете аналог электронной почты для обмена личными письмами (в противовес эхомэйлу)"
    },
    {
        "name": "Нетшкаф",
        "forms": "(или «шкаф»)",
        "description": " — браузер Netscape Navigator, выпускавшийся фирмой Netscape с 1994 по 2007 год"
    },
    {
        "name": "Не эхотажно",
        "forms": "",
        "description": "в фидонете означает что \"нечто\" не относится к эхотагу, т.е. к теме конференции"
    },
    {
        "name": "Ник",
        "forms": "(или «никнейм», от англ. «nickname»)",
        "description": " — псевдоним/прозвище пользователя в сети (на сайте, в соц.сети, на форуме)"
    },
    {
        "name": "Нода",
        "forms": "(или «нод», от англ. «node») ",
        "description": "— узел сети фидо: любой ПК, подсоединенный к блокчейн-сети"
    },
    {
        "name": "Нодедифф",
        "forms": "(или «ноуддифф», «ноддиф», «диф», от англ. «nodediff»)",
        "description": " — файл изменений и дополнений структуры узлов Фидо (список новых и покинувших)"
    },
    {
        "name": "Нодлист",
        "forms": "(или «ноделист», «ноудлист», от англ. «nodelist»)",
        "description": " — список узлов сети Фидонет, который еженедельно обновляется"
    },
    {
        "name": "НОК",
        "forms": "(от англ. «NOC», «Network Operations Center»)",
        "description": " — то же, что дата-центр (место для удаленного хранения и обработки данных серверов, находящихся в нем на хостинге)"
    },
    {
        "name": "Ноулайфер",
        "forms": "(от англ. «nolifer»)",
        "description": " — человек, который практически все свое свободное временя проводит с гаджетом в виртуальном мире (Интернете/соц.сетях/играх), в связи с чем не имеет личной жизни, увлечений и других дел в мире настоящем"
    },
    {
        "name": "Ноут",
        "forms": "(или «нотер», «нотик», «нутыбяка», от англ. «notebook»)",
        "description": " — сокращенно от ноутбук (переносной портативный компьютер)"
    },
    {
        "name": "Нуб",
        "forms": "(или «нубчик», «нубас», «нубарь», «нубак», от англ. «newbie»)",
        "description": " — неопытный новичок, человек, имеющий проблемы с пониманием или применением чего-то"
    },
    {
        "name": "Область видимости",
        "forms": "(от англ. «scope»)",
        "description": " — концепция, которая определяет, где можно использовать переменную, т.е. ее доступность в коде"
    },
    {
        "name": "Обои",
        "forms": "(от англ. «wallpaper») ",
        "description": "— фоновый рисунок на рабочем столе компьютера, телефона или планшета"
    },
    {
        "name": "Обработка исключений",
        "forms": "",
        "description": "— алгоритм обработки ошибок, которые возникают в функции и с которыми она самостоятельно не может справится (функция выбрасывает исключение, заставляя центральный процессор обратиться к ближайшему блоку кода, обрабатывающему исключения этого типа)"
    },
    {
        "name": "Оверквотинг",
        "forms": "(от англ. «overquoting»)",
        "description": " — избыток цитат в написанном тексте или цитирование технической информации, крайне не приветствуется в сети. Также бессмысленное цитирование сообщения, расположенного непосредственно перед ответом, или же многократное вложенное цитирование"
    },
    {
        "name": "Оверклокинг",
        "forms": "(от англ. «overkloking»)",
        "description": " — увеличение производительности компьютера, разгон комплектующих: видеокарта, процессор, память"
    },
    {
        "name": "Овертайм",
        "forms": "(от англ. «overtime»)",
        "description": " — время, которое специалист перерабатывает после окончания установленного рабочего дня, т.е. сверхурочные часы"
    },
    {
        "name": "Окирпичить",
        "forms": "",
        "description": "испортить какой-либо гаджет в процессе неудачной перепрошивки, превратить в «кирпич» (неработающий бесполезный прибор)"
    },
    {
        "name": "Окна",
        "forms": "(или «окошки», «форточки»)",
        "description": " — так иногда называют операционную систему Microsoft Windows из-за логотипа в виде окна"
    },
    {
        "name": "Околоайтишник",
        "forms": "",
        "description": " — специалист, не являющийся айтишником/программистом, но работающий вместе с ними в области IT (бухгалтер, юрист, экономист, кадровик и т.д.)"
    },
    {
        "name": "Оля",
        "forms": "(от англ. «OLE»)",
        "description": " — технология ObjectLinkingandEmbedding, дающая возможность вносить изменения в данные, которые были созданы в иной программе, не покидая основной редактор"
    },
    {
        "name": "Онлайн",
        "forms": "(от англ. «on-line»)",
        "description": " — 1) пребывание пользователя в активном режиме («в сети»); 2) противоположный понятию \"оффлайн\" вид общения, т.е. «в реальном времени»"
    },
    {
        "name": "ООП",
        "forms": "(или «Объектно-Ориентированное Программирование»)",
        "description": " — методология/подход в программировании, в рамках которого программы представляются в виде совокупности объектов, являющихся экземплярами определенных классов, а те, в свою очередь, образуют иерархию наследования"
    },
    {
        "name": "Опенсорс",
        "forms": "(или «открытый код», от англ. «open source software»)",
        "description": "  — ПО/софт (обычно, некоммерческие) с исходным кодом открытого типа, который может использовать/дополнять/редактировать любой желающий"
    },
    {
        "name": "Опенспейс",
        "forms": "(от англ. «open space»)",
        "description": " — рабочее пространство открытого типа без стен и перегородок, в котором специалисты работают все вместе"
    },
    {
        "name": "Операнды",
        "forms": "",
        "description": "1) аргумент операции, данные/объекты, с которыми работает выражение и которые обрабатываются командой; 2) иногда операндом называют место/позицию в тексте, где должен находится аргумент операции"
    },
    {
        "name": "Оперативка",
        "forms": "(или «мозги», «ОЗУ», «RAM»)",
        "description": " — оперативная энергозависимая память ПК, отличающаяся от ПЗУ высокой скоростью чтения/записи"
    },
    {
        "name": "Оптика",
        "forms": "(от англ. «optical fiber»)",
        "description": " — сетевой оптоволоконный кабель/провод, созданный из стекла и пластика, посредством которого происходит передача луча с помощью его отражения"
    },
    {
        "name": "Оракл",
        "forms": "(или «оракул», «оракле», от англ. «oracle»)",
        "description": " — база данных Oracle Database или Oracle RDBMS (СУБД): объектно-реляционная многомодельная система управления базами данных, обычно используемая для выполнения онлайн-обработки транзакций"
    },
    {
        "name": "Ориджин",
        "forms": "(от англ. «origin») ",
        "description": " — крайняя строка письма в эхопочте, которая содержит адрес отправителя. Часто там указывается наименование станции или какой-либо короткий занимательный текст или цитата"
    },
    {
        "name": "ОС",
        "forms": "(или «ось», «операционка», от англ. «Operating System»)",
        "description": " — операционная система, комплекс связанных межд собой ПО, позволяющий управлять аппаратной частью и ресурсами ПК/ноутбуков/смартфонов и т.д."
    },
    {
        "name": "Ослик",
        "forms": "(или «IE», «иа»)",
        "description": " — браузер Internet Explorer, который интегрирован в ОС Windows (планомерно вытесняется веб-проводником Microsoft Edge)"
    },
    {
        "name": "Откат",
        "forms": "(от англ. «rollback»)",
        "description": " — процесс возвращение к исходной версии ПО/приложения/сервиса при обнаружении ошибок и недостатков в новой"
    },
    {
        "name": "Откатить",
        "forms": "от англ. «rollback»)",
        "description": "( — убрать внесенные ранее изменения, вновь вернув предыдущую версию программы/приложения"
    },
    {
        "name": "Отконнектиться",
        "forms": "(или «расконнектиться», от англ. «disconnect»)",
        "description": " — отсоединиться/отделиться от чего-либо (от проекта, от компьютера, от сети и т.д.)"
    },
    {
        "name": "Отладчик",
        "forms": "(или «дебаггер», от англ. «debugger»)",
        "description": "  — ПО, посредством которого автоматизируется процесс поиска ошибок кода (отладки)"
    },
    {
        "name": "Отлаживать",
        "forms": "(от англ. «debug»)",
        "description": " — заниматься отладкой, т.е. поиском ошибок в написанном коде ПО"
    },
    {
        "name": "Отлогиниться",
        "forms": "(или «логофф», от англ. «logoff»)",
        "description": " — выйти из режима зарегистрированного пользователя системы/учетной записи в режим гостя"
    },
    {
        "name": "Отревьюить",
        "forms": "(от англ. «review»)",
        "description": " — просмотреть на предмет ошибок, прокомментировать, дать рецензию и рекомендации"
    },
    {
        "name": "Офлайн",
        "forms": "(или «оффлайн», от англ. «offline»)",
        "description": " — 1) нахождение пользователя «не в сети», или же общение «по факту прочтения» (e-mail, форумы, рассылки); 2) встреча участников мероприятия (форума, конференции и т.д.) вживую, а не в удаленном режиме"
    },
    {
        "name": "Офсайт",
        "forms": "(от англ. «official website»)",
        "description": " — официальный сайт компании/проекта, содержащий актуальную информацию"
    },
    {
        "name": "Офтопик",
        "forms": "(или «офтоп», «офф», от англ. «off topic»)",
        "description": "  — сообщение, отличающееся по своей тематике от главной темы конференции/форума/разговора"
    },
    {
        "name": "Оффер",
        "forms": "(или «офер», «джоб оффер», от англ. «offer»)",
        "description": " — 1) в широком смысле - любое предложение; 2) предложение о работе/вакансия с указанием должности, обязанностей и зарплаты"
    },
    {
        "name": "Очепятка",
        "forms": "",
        "description": "опечатка, ошибка в написанном слове"
    },
    {
        "name": "Пага",
        "forms": "(или «хомяк», от англ. «home page»)",
        "description": "  — домашняя страница, WEB-страничка пользователя, его персональный сайт"
    },
    {
        "name": "Падаван",
        "forms": "",
        "description": "ироничное шутливое название стажёра или джуниора в IT-сфере"
    },
    {
        "name": "Палка",
        "forms": "",
        "description": "1) слеш - косая черта, наклоненная вправо; 2) модуль оперативной памяти"
    },
    {
        "name": "Папка",
        "forms": "(от англ. «folder»)",
        "description": " — экранный объект в графических интерфейсах ОС и программ, некий контейнер, дающий доступ к каталогу файловой системы. Если внутри папки имеются другие папки, то их называют вложенными"
    },
    {
        "name": "Паркинг",
        "forms": "(от англ. «parking»)",
        "description": " — услуга провайдера по хранению неактивных, но зарегистрированных доменных имен"
    },
    {
        "name": "Парковаться",
        "forms": "(от англ. «parking»)",
        "description": " — хранить на сервере/у провайдера зарегистрированное, но не активное доменное имя (без сайта)"
    },
    {
        "name": "Парсер",
        "forms": "(от англ. «parser»)",
        "description": " — 1) участок кода, который ответственен за разбор; 2) круг подпрограмм, которые могут сканировать сайт, собирать и обрабатывать информацию, при этом выдавая себя за обычного посетителя; 3) объектно-ориентированный скриптовый язык программирования, предназначенный для создания HTML-страниц на веб-сервере с поддержкой CGI"
    },
    {
        "name": "Парсить",
        "forms": "(от англ. «parsing»)",
        "description": "  — сбор и анализ информации из открытых источников, разбор чего либо"
    },
    {
        "name": "Паскаль",
        "forms": "(от англ. «зascal»)",
        "description": " — один из самых известных языков программирования Pascal, представляющий собой чисто процедурный язык, который служит основой для ряда других языков"
    },
    {
        "name": "Паттерн",
        "forms": "(от англ. «pattern»)",
        "description": " — 1) наиболее эффективный способ решения характерных задач проектирования, в т.ч. проектирования ПО; 2) в графическом дизайне: бесшовный узор с неоднократно повторяющимися элементами"
    },
    {
        "name": "Патч",
        "forms": "(или «заплатка», «пач», от англ. «patch»)",
        "description": " — дополнение или обновление it-продукта (ПО/приложения), исправляющее обнаруженные ошибки/баги/глюки (процесс применения патча - пропатчивание, пропатчить)"
    },
    {
        "name": "Патч-корд",
        "forms": "(или «коммутационный шнур», «коммутационный кабель», от англ. «Patch Cord»)",
        "description": " — кабель для сопряжения различных устройств друг с другом и подключения активного сетевого оборудования к сети Интернет"
    },
    {
        "name": "Паутина",
        "forms": "(или «всемирная паутина», «ППП», «web»)",
        "description": " — мировая сеть/сложная структура ,связанных между собой посредством гиперссылок , HTML-документов"
    },
    {
        "name": "Пень",
        "forms": "",
        "description": " - центральный процессор торговой марки Pentium, выпускаемый компанией Intel"
    },
    {
        "name": "Перегрузка функций",
        "forms": "",
        "description": " — это возможность определять несколько одноименных функций с разными параметрами"
    },
    {
        "name": "Переполнение",
        "forms": "(от англ. «overflow»)",
        "description": " — ситуация, когда вся память занята, т.е. запрашиваемый объем отсутствует в наличии"
    },
    {
        "name": "Периферия",
        "forms": "(от англ. «peripherals»)",
        "description": " — все внешние устройства ввода и вывода (железо), которые можно подключить к ПК"
    },
    {
        "name": "Перл",
        "forms": "(или «перловка», от англ. «perl»)",
        "description": " — язык программирования Perl, использующийся для разработки скриптов в UNIX-системах"
    },
    {
        "name": "Песочница",
        "forms": "(от англ. «sandbox») ",
        "description": " — 1) специальная область/место/среда, где программа может безопасно выполнятся; 2) на сайте одноименный раздел выделяет категорию для записей новичков (некий фильтр)"
    },
    {
        "name": "Петля",
        "forms": "(или «луп»)",
        "description": " — фрагмент аудио или видео записи, который замыкается в кольцо (петлю) для цикличного воспроизведения"
    },
    {
        "name": "Пет-проект",
        "forms": "(или «pet-проект», от англ. «pet-project»)",
        "description": " — проект (чаще всего личный), который создается и развивается исключительно для получения опыта или как хобби (изредка перерастает в полноценный проект или даже компанию)"
    },
    {
        "name": "Пик Балмера",
        "forms": "",
        "description": " - шуточная теория, выдвинутая Стивом Балмером. Она утверждает, что при наличии алкоголя в крови в промежутке от 0,129 до 0,138% (около 2 банок пива) программист обретает суперспособности к написанию кода"
    },
    {
        "name": "Пилить (жечь) болванку",
        "forms": "",
        "description": "— производить запись каких-либо файлов на диск (CD-R, CD-RW, DVD-R, DVD-RW)"
    },
    {
        "name": "Пилот",
        "forms": "(от англ. «pilot»)",
        "description": "  — 1) тестовая (пилотная) версия продукта, либо отдел фирмы, выбранный для опробации/обкатывания этого продукта; 2) сетевой фильтр для сохранения техники от поломок, связанных со скачками напряжения"
    },
    {
        "name": "Пинг",
        "forms": "(от англ. «ping»)",
        "description": " — программа для проверки связи в сети, ее целостности и качества; 2) характеристика скорости сетевого соединения, т.е. время прохождения пакета данных до адресата и обратно (измеряется в миллисекундах)"
    },
    {
        "name": "Пинговать",
        "forms": "(от англ. «ping»)",
        "description": " — проводить проверку ресурса на доступность с использованием утилиты «Ping»"
    },
    {
        "name": "Пинч",
        "forms": "(от англ. «pinch»)",
        "description": " — «щипающее» движение пальцами на тачскрине, которое позволяет уменьшить размер/масштаб изображения/страницы"
    },
    {
        "name": "Пират",
        "forms": "(от англ. «pirate»)",
        "description": " — человек, занимающийся воровством и незаконной продажей запатентованного авторского контента (фильмы, музыка, книги и т.д.)"
    },
    {
        "name": "Пиратка",
        "forms": "(от англ. «pirate»)",
        "description": " — нелицензионные программы/утилиты/ОС, скаченные с \"пиратских\" ресурсов"
    },
    {
        "name": "Писиспикер",
        "forms": "(или «писиськер», от англ. «PC speaker»)",
        "description": " — динамик, который встроен непосредственно в компьютер (обычно издает лишь писк для диагностики, но можно вывести и звук со звуковой карты)"
    },
    {
        "name": "Писюк",
        "forms": "(от англ. «PC», «personal computer»)",
        "description": " — персональный компьютер"
    },
    {
        "name": "Питон",
        "forms": "(или «пайтон», «путон», от англ. «Python»)",
        "description": " — популярный высокоуровневый язык программирования общего назначения, отличающийся хорошей читабельностью кода и чистым выразительным синтаксисом"
    },
    {
        "name": "Планка",
        "forms": "(или «плашка»)",
        "description": " — отдельный модуль оперативной памяти, содержащий микросхемы запоминающего устройства"
    },
    {
        "name": "Плюсомёт",
        "forms": "",
        "description": " - в Фидонете метафоричное название оружия модератора, которым он раздаёт плюсы [+] , т.е. строгие предупреждения за нарушения правил эхи"
    },
    {
        "name": "Плюшки",
        "forms": "",
        "description": "— некие бонусы/привилегии, что-то полезное и нужное (часто относятся к условиям работы или функциям приложения)"
    },
    {
        "name": "ПМК",
        "forms": "",
        "description": "— советский программируемый микрокалькулятор типа «Электроника Б3-34» и «МК-54/-56/-61/-52»"
    },
    {
        "name": "ПО",
        "forms": "(или «ПэО», от англ. «software»)",
        "description": " — программное обеспечение: одна или несколько программ (комплекс), которые используются для нормального функционирования компьютера"
    },
    {
        "name": "Побитовые операции",
        "forms": "(от англ. «bitwise operations»)",
        "description": " — операции над отдельными битами (цепочками битов) в границах одной переменной, в т.ч. битовые сдвиги и применение побитовых операторов"
    },
    {
        "name": "Повесить",
        "forms": "",
        "description": "1) выполнить какое-либо действие, которое приведет к зависанию компьютера/сервера/программы и т.д.; 2) свернуть документ или окно в панель задачь"
    },
    {
        "name": "Подвал",
        "forms": "(или «футер»)",
        "description": " — в веб-дизайне так называют нижнюю часть страницы/сайта, содержащую служебную информацию"
    },
    {
        "name": "Подкаст",
        "forms": "(от англ. «podcast»)",
        "description": " — цикл уроков видео или аудио формата, рассказы/лекции по определённой тематике, чаще всего образовательного характера"
    },
    {
        "name": "Подставка под кофе",
        "forms": "",
        "description": "— компакт-диск или дисковод (выезжающая панель CD-RОM)"
    },
    {
        "name": "Поженить",
        "forms": "",
        "description": "сделать так, чтобы что-то одно соответствовало чему-то другом"
    },
    {
        "name": "Поинт",
        "forms": "(или «пойнт», «точка», от англ. «point»)",
        "description": " — 1) член сети фидо, который не держит станцию, а пользуется адресом своего узла-босса; 2) низовой пользователь Фидонета, который не имеет даунлинков"
    },
    {
        "name": "Пойнтлист",
        "forms": "(или «поинтлист», от англ. «pointlist»)",
        "description": " — список пойнтов некоторого узла/сети/региона"
    },
    {
        "name": "Пойнтовка",
        "forms": "(от англ. «point»)",
        "description": " — вечеринка/тусовка/сходка фидошников"
    },
    {
        "name": "Полететь",
        "forms": "(или «слететь») ",
        "description": "— удалиться, перестать корректно работать/функционировать (относится к программам, драйверам, сайтам и т.д.)"
    },
    {
        "name": "Полиси",
        "forms": "(от англ. «policy»)",
        "description": " — устав сети Фидонет, утвержденный голосованием ее координаторов"
    },
    {
        "name": "Полл",
        "forms": "(от англ. «poll»)",
        "description": " — команда/файл, появление которых активирует прозвонку на ноду"
    },
    {
        "name": "Полуось",
        "forms": "",
        "description": "операционная система OS/2 фирмы IBM, которая до 1992 года разрабатывалась с участием Microsoft"
    },
    {
        "name": "Попап",
        "forms": "(от англ. «pop-up»)",
        "description": " — всплывающее окно на сайте/в приложении, обычно рекламного характера"
    },
    {
        "name": "Поплыла вёрстка",
        "forms": "",
        "description": "— ситуация, когда страницы браузере отображаются некорректно (например, со сдвигом важных элементов интерфейса)"
    },
    {
        "name": "Пост",
        "forms": "(от англ. «post»)",
        "description": " — опубликованная запись/публикация/статья в интернет-пространстве (соц.сети, форуме, блоге)"
    },
    {
        "name": "Постинг",
        "forms": "(от англ. «post»)",
        "description": " — процесс создания и публикации постов в интернет-пространстве"
    },
    {
        "name": "Постить",
        "forms": "(от англ. «post»)",
        "description": " — 1) делать и публиковать посты в соцсетях, в блоге, на форуме; 2) в Фидонете означает процесс отправки сообщения в эху"
    },
    {
        "name": "Пофиксить",
        "forms": "(или «фиксить», от англ. «fix»)",
        "description": " — исправить/наладить работу, внести необходимые правки"
    },
    {
        "name": "Поюзанный",
        "forms": "(или «юзанный», от англ. «use»)",
        "description": " — нечто, использовавшееся ранее, бывшее в употреблении (б/у)"
    },
    {
        "name": "Поюзать",
        "forms": "(или «юзнуть», от англ. «use»)",
        "description": " — попробовать в использовании что-то (например, новый гаджет), протестировать неизвестный ранее функционал"
    },
    {
        "name": "Превьюшка",
        "forms": "(или «превью», от англ. «Preview») ",
        "description": "— компактные/уменьшенные в несколько раз изображения (миниатюры) для более удобного предварительного просмотра"
    },
    {
        "name": "Препроцессор",
        "forms": "(от англ. «preprocessor»)",
        "description": " — модуль компилятора, который целиком обрабатывает каждый предназначенный для компиляции файл и формирует текст, попадающий затем на вход компилятора"
    },
    {
        "name": "Приват",
        "forms": "(от англ. «private»)",
        "description": "— личная/приватная переписка двух участников чата/форума/социальной сети, недоступная для просмотра остальным пользователям"
    },
    {
        "name": "Прикрепление",
        "forms": "(или «вложение»)",
        "description": " — файлы, прикрепленные к электронному письму (документы, видео и аудио записи, изображения и т.д.)"
    },
    {
        "name": "Провайдер",
        "forms": "(от англ. «ISP», «Internet Service Provider»)",
        "description": " — компания, предоставляющая юзерам доступ к сети Интернет и дополнительные связанные с этим услуги"
    },
    {
        "name": "Провалиться",
        "forms": "(от англ. «drill down») ",
        "description": " — 1) раскрыть выпадающее меню приложения/сайта для просмотра детализированных данных; 2) перейти по клику из общей формы к необходимому файлу/документу"
    },
    {
        "name": "Прога",
        "forms": "(от англ. «program»)",
        "description": " — программа/программное обеспечение/утилита"
    },
    {
        "name": "Прогать",
        "forms": "(или «прожить», от англ. «programming»)",
        "description": " — заниматься программированием, писать код программы/приложения"
    },
    {
        "name": "Программа",
        "forms": "(от англ. «program»)",
        "description": " — комбинация/набор/перечень данных инструкций, которые позволяют компьютеру корректно работать"
    },
    {
        "name": "Программер",
        "forms": "(или «прог», «прогер», от англ. «programmer»)",
        "description": " — программист, человек, занимающийся программированием/разработкой ПО"
    },
    {
        "name": "Прод",
        "forms": "(или «продакшн», «продуктив», от англ. «production environment») ",
        "description": "— компьютер/сервер, где запускается готовое работоспособное приложение"
    },
    {
        "name": "Продакшн",
        "forms": "(или «продакшен», «продакшн-код», от англ. «production»)",
        "description": " — 1) код для рабочей версии ПО/приложения; 2) в широком смысле:процесс создания какого-либо проекта или продукта (обычно, творческого)"
    },
    {
        "name": "Продолжительность жизни переменной",
        "forms": "(или «время жизни») ",
        "description": " — показатель, который определяет период хранения переменной, когда она создается и где уничтожается"
    },
    {
        "name": "Продуктив",
        "forms": "(от англ. «production»)",
        "description": " — 1) реальная среда работы сайта, т.е. сам сайт, установленный на сервер и доступный для посетителей; 2) продуктивная эксплуатация программного продукта"
    },
    {
        "name": "Прокси-сервер",
        "forms": "(или «прокси», «прокся», от англ. «proxy»)",
        "description": " — некое ПО/сервер, являющийся промежуточным звеном (посредником) между юзером и конечным сайтом/сервером. Прокси-сервер позволяет одним компьютерам выполнять запросы к другим от своего имени, чтобы обеспечить приватность, конфиденциальность и затруднить возможность отслеживания пользователя"
    },
    {
        "name": "Прополоть",
        "forms": "",
        "description": "— в Фидонете: запустить прозвонку на ноду"
    },
    {
        "name": "Прорезать",
        "forms": "",
        "description": "— добавить в интерфейс ПО/приложения дополнительный объект/элемент, который не был предусмотрен ранее стандартным решением. Вместе с тем добавить его обработку в программный код, атак же в соответствующую таблицу базы данных"
    },
    {
        "name": "Пространство имен",
        "forms": "(от англ. «namespace»)",
        "description": " — некоторая область кода, где гарантируется уникальность/оригинальность всех идентификаторов, их логическая группировка"
    },
    {
        "name": "Протокол",
        "forms": "(или «протокол передачи данных», от англ. «data transfer protocol») ",
        "description": "— определенный стандарт/правила/соглашения по обмену данными между различными устройствами"
    },
    {
        "name": "Прототип функции",
        "forms": "(от англ. «function prototype»)",
        "description": " — в языках Си и C++ так называют предварительное объявление функции, состоящее из ее имени, типа возврата функции и параметров (не содержит тело, т.е. основную часть функции)"
    },
    {
        "name": "Профан",
        "forms": "",
        "description": "— Человек без опыта в какой-либо сфере, совсем не разбирающийся в чём-то"
    },
    {
        "name": "Профит",
        "forms": "(от англ. «profit»)",
        "description": " — 1) в широком смысле - определенный положительный результат чего-либо: прибыль/выгода/польза; 2) на бирже: разницу между вложенными инвестициями и полученным чистым доходом"
    },
    {
        "name": "Прошивка",
        "forms": "",
        "description": "— ПО/программный код, встроенный в энергонезависимую память устройства и управляющий его работой (модем, GPS-навигатор, смартфон, маршрутизатор и др.)"
    },
    {
        "name": "Прошить",
        "forms": "(или «перепрошить»)",
        "description": "  — изменить прошивку, т.е отредактировать программный код устройства"
    },
    {
        "name": "Пул реквест",
        "forms": "(от англ. «pull request»)",
        "description": " — запрос на подтверждение коммита, т.е. на изменение кода в чужом репозитории"
    },
    {
        "name": "Пушить",
        "forms": "(или «запушить», от англ. «push»)",
        "description": " — 1) использовать команду push, публиковать что-то, например, выгружаемые локальные изменения, код на git; 2) настаивать, принуждать к чему-либо, заставлять, давить"
    },
    {
        "name": "Пуэрпоинт",
        "forms": "(или «пауэрпоинт», «паверпоинт», от англ. «PowerPoint»)",
        "description": " — программа для создания и просмотра презентаций, которая является частью Microsoft Office"
    },
    {
        "name": "Пэн",
        "forms": "(от англ. «pan»)",
        "description": " — движение по экрану с ранее увеличенным изображением, которое позволяет увидеть части экрана, которые ранее были сткрыты"
    },
    {
        "name": "Пэхапэ",
        "forms": "(или «пыха», от англ. «PHP»)",
        "description": " — язык программирования PHP: опенсорcный скриптовый язык, активно применяемый при разработке серверных частей современных веб-проектов"
    },
    {
        "name": "Радиобаттон",
        "forms": "(от англ. «radio button»)",
        "description": "  — элемент интерфейса, позволяющий пользователю выбрать только одну опцию (пункт) из предопределенного набора (группы). Обычно выглядит как пустой кружочек или ромбик. При выборе «зажигается»"
    },
    {
        "name": "Разраб",
        "forms": "(от англ. «developer») ",
        "description": " — сокращение от разработчик, с намеком на тяжелый и подневольный «рабский» труд"
    },
    {
        "name": "Рандом",
        "forms": "(или «рандомный», от англ. «random»)",
        "description": " — случайная вероятность получения определенного результата при совершение какого-либо действия"
    },
    {
        "name": "Рантайм",
        "forms": "(от англ. «runtime»)",
        "description": " — вычислительное окружение, которое требуется для выполнения какой-либо компьютерной программы и доступное во время её выполнения"
    },
    {
        "name": "Рапида",
        "forms": "(от англ. «rapidshare») ",
        "description": " — популярный файлообменный сервер Rapidshare, существовавший с 2005 по 2015 год"
    },
    {
        "name": "Рарить",
        "forms": "(от англ. «RAR»)",
        "description": " — использовать программу-архиватор RAR для создания архивов"
    },
    {
        "name": "Расшарить",
        "forms": "(или «шарить», «шерить», от англ. «share»)",
        "description": " — сделать открытым/поделиться доступом к какому-то ресурсу/файлу/папке в локальной сети с одним или несколькими людьми"
    },
    {
        "name": "Реал",
        "forms": "(от англ. «real»)",
        "description": " — реальный мир, все то, что находится вне сети Интернет"
    },
    {
        "name": "Реалтайм",
        "forms": "(или «RTOS», «СРВ», от англ. «Real-Time Operating System») ",
        "description": "— операционная система, которая предназначена для обслуживания приложений реального времени, обрабатывающих данные по мере их поступления (без задержек в буфере)"
    },
    {
        "name": "Ребейс",
        "forms": "(от англ. «git rebase»)",
        "description": " — команда для синхронизации с главной веткой, в которую коммитят все разработчики проекта. Это необходимо, чтобы иметь возможность смержиться с master веткой, если кто-то изменит участок кода в совей ветке. Обычно производится перед началом рабочего дня и после его окончания, когда фича готова"
    },
    {
        "name": "Ребзя",
        "forms": "",
        "description": "— используется, как обращение к кому-либо, означает ребята/парни"
    },
    {
        "name": "Ребутнуть",
        "forms": "(или «ребутить», «сделать ребут», от англ. «reboot»)",
        "description": "  — перезагружать электронное устройство/систему"
    },
    {
        "name": "Ревью",
        "forms": "(или «кодревью», от англ. «review») ",
        "description": "— рецензирование/вычитка/проверка кода с целью обнаружения и исправления ошибок"
    },
    {
        "name": "Регэкспы",
        "forms": "(или «регулярки», «регулярные выражения», от англ. «regexp,regular expressions»)",
        "description": " — формальный язык поиска и осуществления манипуляций с подстроками в тексте, который основан на применении метасимволов. Поддерживается практически всеми современными языками программирования"
    },
    {
        "name": "Редизайн",
        "forms": "(от англ. «redesign»)",
        "description": " — обновление и модификация визуальной графической или структурно-функциональной составляющей приложения/сайта/интерфейса и т.д."
    },
    {
        "name": "Редирект",
        "forms": "(от англ. «redirect»)",
        "description": " — автоматическое перенаправление/переадресация юзера куда-либо: на другой сайт, на другую страницу, на другую почту и т.д."
    },
    {
        "name": "Резак",
        "forms": "",
        "description": "— устройство для нарезки (записи) оптических дисков: CD, DVD"
    },
    {
        "name": "Рекурсивная функция",
        "forms": "(от лат. recursio )",
        "description": "—  - числовая функция, содержащая в своем определении себя, т.е. она вызывает саму себя"
    },
    {
        "name": "Рекурсия",
        "forms": "(от англ. «recursion»)",
        "description": " — определение/описание какого-либо объекта/процесса с помощью самого этого объекта/процесса"
    },
    {
        "name": "Релиз",
        "forms": "(от англ. «release»)",
        "description": "  — представление готовой стабильной версии продукта, прошедшей тестирование (игры/программы/песни/альбома), ее выпуск в открытый доступ"
    },
    {
        "name": "Рендер",
        "forms": "(от англ. «render»)",
        "description": " — изображение/модель, которая была сгенерирована в 3D-редакторе"
    },
    {
        "name": "Рендеринг",
        "forms": "(от англ. «rendering») ",
        "description": "— 1) преобразование данных из внутреннего формата редактора в выходной формат, процесс вывода; 2) в компьютерной графике имеют ввиду создание цифрового растрового изображения,сделанного по разработанной 3D-сцене или другим данным"
    },
    {
        "name": "Репозиторий",
        "forms": "(или «репа», от англ. «repository»)",
        "description": " — хранилище исходных файлов проекта (программ, объектов, метаданных и т. п.)"
    },
    {
        "name": "Рефакторинг кода",
        "forms": "(от англ. «refactoring»)",
        "description": "  — корректировка исходного кода ПО для того, чтобы сделать его \"чистым\", т.е. простым и легким для понимания и последующей поддержки"
    },
    {
        "name": "Референс",
        "forms": "(или «рефка», «реф», от англ. «reference»)",
        "description": " — пример/образец, дающий приблизительное представление о том, что хотелось бы увидеть или получить в итоге"
    },
    {
        "name": "Ридми",
        "forms": "(от англ. «read me»)",
        "description": "  — файл Readme, который обычно содержит подробную информацию о программе, документацию, инструкции, которые необходимо прочитать перед первым запуском ПО"
    },
    {
        "name": "Ридонли",
        "forms": "(от англ. «read only»)",
        "description": "  — 1) режим «только чтение», т.е. запрет редактирования программы/документа/презентации; 2) в Фидонете: запрет писать в эху (самый строгий модераториал/наказание от модератора)"
    },
    {
        "name": "Рисёрч",
        "forms": "(или «ресерч», от англ. «research») ",
        "description": "— поиск полезной информации, изучение определенной темы с целью разобраться в ней, понять суть, детали"
    },
    {
        "name": "РоР",
        "forms": "(или «Руби он рэйлс», от англ. «RoR», «Ruby on Rails»)",
        "description": "  — Открытый и свободный фреймворк для создания веб-приложений, написанный на языке программирования Ruby. Платформа реализует архитектурный шаблон Model-View-Controller для веб-приложений, а также обеспечивает их интеграцию с веб-сервером и сервером баз данных"
    },
    {
        "name": "Роутинг",
        "forms": "(или «рутинг», «маршрутизация», от англ. «routing») ",
        "description": "— процесс определения маршрута следования информации/данных в сетях связи (трафика)"
    },
    {
        "name": "Руби",
        "forms": "(от англ. «Ruby»)",
        "description": " — интерпретируемый язык программирования высокого уровня \"Ruby\". Лёгкий в разработке, используется, в основном, при разработке веб-приложений"
    },
    {
        "name": "Рубиться",
        "forms": "(или «зарубиться»)",
        "description": " — увлечено играть, соревноваться с кем-либо"
    },
    {
        "name": "Ругаться",
        "forms": "",
        "description": "— в отношении ПО/приложений: выдача уведомлений/сообщений об ошибках в коде, предупреждения и т.д."
    },
    {
        "name": "Рулез",
        "forms": "(от англ. «rules»)",
        "description": " — выражение одобрения/похвалы чего-то (программы, проекта, ПО и т.д.)"
    },
    {
        "name": "Рулесы",
        "forms": "(или «рулеса», от англ. «rules»)",
        "description": " — правила (эхи или фэхи), которые через некоторое количество время периодически постит модератор"
    },
    {
        "name": "Рунет",
        "forms": "(от англ. «runet»)",
        "description": "  — русскоязычный сегмент Интернета - совокупность сайтов с контентом на русском языке"
    },
    {
        "name": "Рут",
        "forms": "(от англ. «root»)",
        "description": " — 1) учётная запись администратора; 2) полный расширенный доступ к системе компьютера; 3) системный администратор; 4) корневая директория чего-либо; 5) отправная точка (объект) в иерархии"
    },
    {
        "name": "Руткит",
        "forms": "(от англ. «rootkit»)",
        "description": "  — ПО, которая захватывает контроль над системой, маскируя следы присутствия другой программы/файлов или самой себя"
    },
    {
        "name": "Рыбий глаз",
        "forms": "(или «фишай», от англ. «fish-eye») ",
        "description": " — 1) сверхширокоугольный объектив с целенаправленно увеличенной дисторсией (коэффициент линейного увеличения, изменяющийся по мере удаления отображаемых предметов от оптической оси); 2) фото полученное с помощью такого объектива"
    },
    {
        "name": "Рэк",
        "forms": "(от англ. «rack»)",
        "description": " — оборудование, стандартная 19-дюймовая стойка (шкаф) для ИТ-оборудования"
    },
    {
        "name": "Cёрфер",
        "forms": "(от англ. «surfing»)",
        "description": "  — в it-сфере: активный пользователь мировой паутины (www)"
    },
    {
        "name": "Cтейтмент",
        "forms": "(от англ. «statement»)",
        "description": "  — в языках программирования: самая малая независимая единица, являющаяся самым распространенным типом инструкций в программах. Разработчики пишут стейтменты, чтобы выполнить какое-то задание"
    },
    {
        "name": "Саббатикал",
        "forms": "(от англ. «sabbaticals»)",
        "description": "  — временный перерыв в работе/карьерный тайм-аут для сотрудника с целью избежать выгорания (или преодолеть уже наступившее), чтобы сохранить своё место на работе"
    },
    {
        "name": "Сабж",
        "forms": "(или «сабдж», «субж», «субъект», от англ. «subject»)",
        "description": " — тема электронного сообщения, предмет обсуждения/тема для диалога между людьми на форуме или другом ресурсе, тема для начала разговора/дискуссии"
    },
    {
        "name": "Сантехника",
        "forms": "",
        "description": " — операционная система SunOS или Solaris - версии операционной системы UNIX, разработанные компанией Sun Microsystems для рабочих станций и серверов собственного производства"
    },
    {
        "name": "Саппорт",
        "forms": "(или «супорт», «поддержка», «сап», от англ. «support»)",
        "description": " — служба технической поддержки, в которую пользователи продукта или услуги могут обратиться за оказанием помощи по разрешению возникших трудностей и получением дополнительной информации"
    },
    {
        "name": "Свайп",
        "forms": "(или «слайд», «swype», от англ. «slide»)",
        "description": " — 1) специальное \"смахивающее\" движение пальца по сенсорному дисплею; 2) особый способ беспрерывного набора текста одной линией на сенсорном экране в приложении Swype Keyboard"
    },
    {
        "name": "Свап",
        "forms": "(или «своп», от англ. «swap»)",
        "description": " — файл подкачки в ОС: файл/раздел жёсткого диска, предназначенный для «выгрузки» в него неиспользуемых страниц из оперативной памяти"
    },
    {
        "name": "Свитчер",
        "forms": "(от англ. «switcher»)",
        "description": "  — человек, пришедший в сферу IT/программирование из другой сторонней профессии"
    },
    {
        "name": "Свитчнуть",
        "forms": "(или «свичнуть», от англ. «switch»)",
        "description": " — переключить"
    },
    {
        "name": "Сдохнуть",
        "forms": "",
        "description": "— сломаться/перестать работать"
    },
    {
        "name": "Сейвить",
        "forms": "(или «засейвить», «сэйвить», от англ. «save»)",
        "description": " — сохранить внесенные изменения/важную информацию"
    },
    {
        "name": "Секьюрный",
        "forms": "(от англ. «security»)",
        "description": " — безопасный, надежный, защищенный"
    },
    {
        "name": "Семантическая ошибка",
        "forms": "(от англ. «semantic error»)",
        "description": " — ошибка, характеризующаяся неправильной работой кода при его правильном синтаксическом строении"
    },
    {
        "name": "Сеньор",
        "forms": "(или «сеньор-помидор», «сеньйор,сениор», от англ. «Senior Developer»)",
        "description": "  — самый высокий уровень знаний/подготовки и навыков специалиста в it-сфере"
    },
    {
        "name": "Сервак",
        "forms": "(или «сервер», «сервант», «сёрвер», «аппаратное обеспечение», от англ. «server»)",
        "description": " — специализированный мощный компьютер, предназначенный для выполнения сервисного ПО, хранения данных и обеспечения доступа к ним"
    },
    {
        "name": "Сервис пак",
        "forms": "(от англ. «service pack»)",
        "description": " — комплекс необходимых обновлений/улучшений ПО или ОС, поставляемый как единый установочный пакет"
    },
    {
        "name": "Сёрфинг",
        "forms": "(от англ. «surfing»)",
        "description": " — просмотр различных ресурсов/сайтов, беглое поверхностное пролистывание страниц в Интернете"
    },
    {
        "name": "Сессия",
        "forms": "(от англ. «session»)",
        "description": "  — 1) в веб-аналитике: последовательность заПросов отдельного пользователя во время посещения определенного сайта; 2) период от входа на сервер/систему/сайт до выхода из них; 3) период от запуска браузера до его закрытия"
    },
    {
        "name": "Сетевик",
        "forms": "",
        "description": "it-специалист, который отвечает за поддержание работоспособности локальной сети (ЛВС): активного оборудования сети и СКС (структурированной кабельной системы)"
    },
    {
        "name": "Сетёвка",
        "forms": "(или «сходка», «сисопка», «фидопойка»)",
        "description": " — неформальная встреча, куда фидошники (участники Фидонета) приходят пообщаться и увидеть друг друга вживую"
    },
    {
        "name": "Сетевуха",
        "forms": "(или «сетевуха», «сетевая плата», «сетевая карта», «сетевой адаптер»)",
        "description": " — специальное интерфейсное устройство, которое позволяет ПК взаимодействовать с другими устройствами локальной сети"
    },
    {
        "name": "Сетка",
        "forms": "",
        "description": "1) локальная сеть , т.е. среда взаимодействия нескольких ПК; 2) в сфере дизайна: модульная сетка, используемая для дизайна и вёрстки страниц"
    },
    {
        "name": "Сеть (с большой буквы)",
        "forms": "",
        "description": "— имеется ввиду Интернет: комплекс ресурсов, доступных в протоколе TCP/IP"
    },
    {
        "name": "сеть (с маленькой буквы)",
        "forms": "",
        "description": "— связанные между собой компьютеры, независимо от протокола"
    },
    {
        "name": "Си",
        "forms": "(или «сишка», «сижка»)",
        "description": " — популярный компилируемый статически типизированный язык программирования C, ставший основой для таких языков, как C++, C#, Java и Objective-C"
    },
    {
        "name": "Сидер",
        "forms": "",
        "description": " — юзер, который может инициировать раздачу, т.к. обладает готовым к раздаче файлом"
    },
    {
        "name": "Сидюк",
        "forms": "",
        "description": "— CD-ROM или CD-RW"
    },
    {
        "name": "Сиквел",
        "forms": "(или «SQL», от англ. «sequel»)",
        "description": " — простой язык структурированных запросов, который имеет немного команд"
    },
    {
        "name": "Симка",
        "forms": "",
        "description": "— 1) модуль памяти SIMM с однорядным расположением контактов (использовался в 90-х в компьютерах); 2) SIM-карта оператора связи в телефонах/смартфонах"
    },
    {
        "name": "Синбаи",
        "forms": "(от англ. «seen by»)",
        "description": " — в Фидонете: служебные строки в конце сообщения, показывающие узлы, которым оно было доставлено"
    },
    {
        "name": "Синий экран (смерти)",
        "forms": "(или «синяк», «бсод», от англ. «Blue Screen Of Death»)",
        "description": " — серьёзная ошибка в OС Microsoft Windows, характеризующаяся появлением \"синего экрана\" и требующая перезагрузки системы"
    },
    {
        "name": "Синтаксис",
        "forms": "(от англ. «syntax»)",
        "description": "  — порядок/правила, регулирующие построение предложений"
    },
    {
        "name": "Синтаксическая ошибка",
        "forms": "(от англ. «syntax error»)",
        "description": " — ошибка, возникающая при написании кода, не соответствующего правилам грамматики выбранного языка программирования"
    },
    {
        "name": "Сионист",
        "forms": "(или «сишник»)",
        "description": " — it-специалист, который программирует (пишет код) на языке Си"
    },
    {
        "name": "Сисадмин",
        "forms": "(или «системный администратор», от англ. «System Administrator»)",
        "description": "  — специалист, занимающийся обеспечением бесперебойной работы всех компьютерной техники компании, сети и ПО"
    },
    {
        "name": "Сисоп",
        "forms": "(от англ. «System Operator»)",
        "description": "  — системный оператор/админ ББС (Bulletin Board System) или фидошного узла, который отвечает за поддержание стабильной работы, и регулярное обновление файловой базы и др."
    },
    {
        "name": "Системник",
        "forms": "(или «корпус», «коробка», «системный блок»)",
        "description": " — элемент ПК, \"внешняя оболочка\", обеспечивающая защиту внутренних компонентов компьютера от механических повреждений и внешнего воздействия"
    },
    {
        "name": "Скилл",
        "forms": "(или «скиллы,скилы», от англ. «skill»)",
        "description": " — навыки, умения, мастерство в определенной сфере деятельности"
    },
    {
        "name": "Скин",
        "forms": "(или «шкурка», от англ. «skin»)",
        "description": " — внешний вид/оболочка/дизайн приложения/ПО/системы, который пользователь может изменять самостоятельно по своему желанию"
    },
    {
        "name": "Скипнуть",
        "forms": "(от англ. «skip»)",
        "description": "  — пропустить или пролистать (обычно применяется к уведомлениям или рекламе)"
    },
    {
        "name": "Скопипастить",
        "forms": "(от англ. «copy-paste»)",
        "description": "  — позаимствовать/скопировать откуда-либо информацию и без изменений добавить ее в свой проект"
    },
    {
        "name": "Скрам",
        "forms": "(от англ. «scrum»)",
        "description": " — один из методов управления проектами, является частью гибкой методологии разработки Agile. Обычно используется в сфере разработки ПО, но может применятся и в других производственных отраслях"
    },
    {
        "name": "Скрин",
        "forms": "(или «скриншот», от англ. «screenshot»)",
        "description": " — снимок экрана компьютера или смартфона в данный момент времени, сохраненный в графический файл"
    },
    {
        "name": "Скринсейвер",
        "forms": " (от англ. «screensaver»)",
        "description": " — заставка на экране (как правило, динамическая), которая активируется во время того, как пользователь не производит каких-либо действий и «сохраняет экран»"
    },
    {
        "name": "Скрипт",
        "forms": "(от англ. «script»)",
        "description": " — 1) программный файл сценария (часть написанного кода), автоматизирующий какую-то задачу, предотвращая работу вручную; 2) некий сценарий, где прописан ход беседы/последовательность действий при общении с клиентом (по телефону, лично в точке продаж и т.д.)"
    },
    {
        "name": "Скроллинг",
        "forms": "(от англ. «scrolling», «scroll»)",
        "description": " — прокрутка экрана (колесом мыши, бегунком на странице или движением пальца по сенсорному дисплею) с целью просмотра большого блока информации (например, длинная статья или книга)"
    },
    {
        "name": "Слайд",
        "forms": "(от англ. «slide»)",
        "description": " — 1) отдельная «страничка» в презентации, используемая для визуализации необходимой информации; 2) то же, что и \"свайп\", т.е. \"смахивающее\" движение по экрану"
    },
    {
        "name": "Слететь",
        "forms": "(или «слёт»)",
        "description": "в отношении компьютерного ПО: ситуация, когда установленные ранее настройки/параметры внезапно и незапланированно стерлись или подверглись изменению. Иногда, имеют ввиду резкое прекращение работы программы/приложения"
    },
    {
        "name": "Слить",
        "forms": "(от англ. «merge»)",
        "description": "1) загрузить файлы с сервера на локальный компьютер; 2) предоставить в общественный доступ чью-то личную информацию/фото/видео и т.д."
    },
    {
        "name": "Слоупок",
        "forms": "(от англ. «slowpoke»)",
        "description": "характеризует медлительных несообразительных людей (название пришло из Аниме: так звали розового покемона - Slowpoke)"
    },
    {
        "name": "Сниппет",
        "forms": "(от англ. «snippet»)",
        "description": "фрагмент, небольшая часть чего-то (исходного текста/програмного кода), пригодная для вторичного использования"
    },
    {
        "name": "Сносить",
        "forms": "(или «снести»)",
        "description": "удалять, деактивировать, стирать имеющиеся настройки, деинсталлировать ПО"
    },
    {
        "name": "Собес",
        "forms": "(или «собеседование», от англ. «interview»)",
        "description": "беседа представителя работодателя с кандидатом на вакантную должность"
    },
    {
        "name": "Софт",
        "forms": "(от англ. «software»)",
        "description": "программное обеспечение (ПО): совокупность программ, установленных на конкретном компьютере"
    },
    {
        "name": "Софт скиллы",
        "forms": "(от англ. «soft skills»)",
        "description": "навыки социализации в обществе: социальные/коммуникативные/личностные качества человека, необходимые, в том числе, для адаптации в коллективе"
    },
    {
        "name": "Спам",
        "forms": "(от англ. «spam»)",
        "description": "\"надоедливые\" электронные письма и сообщения с рекламой, которые получают пользователи, не соглашавшиеся на рассылку"
    },
    {
        "name": "Спамить",
        "forms": "(от англ. «spam»)",
        "description": "1) отправлять спам (рекламные сообщения и письма); 2) писать множество писем/сообщений (то же, что \"флудить\")"
    },
    {
        "name": "Сплит",
        "forms": "(от англ. «split»)",
        "description": "1) разделение очень длинной строки на отдельные части; 2) утрата синхронизации между разными серверами в единой сети"
    },
    {
        "name": "Спрайт",
        "forms": "(от англ. «sprite»)",
        "description": "в компьютерной графике: графический объект, растровое изображение, отображающееся на экране"
    },
    {
        "name": "Спринт",
        "forms": "(от англ. «sprint»)",
        "description": "в методологии управления проектами Scrum: обозначенный временной отрезок (обычно от 1 до 4 недель), за который специалисты обязаны успеть выполнить поставленную задачу"
    },
    {
        "name": "Статическая библиотека",
        "forms": "(от англ. «Static Library»)",
        "description": "включает в себя подпрограммы, которые компилируются и линкуются с вашей программой. При компиляции программы, использующей статическую библиотеку, весь функционал библиотеки становится частью вашего исполняемого файла"
    },
    {
        "name": "Статическая переменная",
        "forms": " (или «переменная со статической продолжительностью жизни», от англ. «Static variable»)",
        "description": "переменная, сохраняющая свое значение даже после выхода из блока, в котором она определена (создается и инициализируется всего единожды, а после сохраняется на протяжении выполнения всей программы"
    },
    {
        "name": "Стек",
        "forms": "(от англ. «Stack»)",
        "description": "1) в широком смысле: абстрактный тип данных; 2) список технологий, применяемых разработчиком или компанией"
    },
    {
        "name": "Стек вызовов",
        "forms": "",
        "description": "отслеживает все активные функции (уже вызванные, но пока не завершенные) от начала программы и до текущей точки выполнения, а атк же обрабатывает выделение всех параметров функции и локальных переменных"
    },
    {
        "name": "Стретч",
        "forms": "(от англ. «stretch»)",
        "description": "«растягивающее» движение пальцами на тачскрине, которое позволяет увеличить размер/масштаб изображения/страницы"
    },
    {
        "name": "Стрим",
        "forms": "(от англ. «stream»)",
        "description": "онлайн-трансляция происходящих в данный момент событий/действий"
    },
    {
        "name": "Стример",
        "forms": "(от англ. «stream»)",
        "description": "человек, который организует/запускает стрим (онлайн-трансляцию)"
    },
    {
        "name": "Стримить",
        "forms": "(от англ. «stream»)",
        "description": "процесс проведения стрима (онлайн-трансляции)"
    },
    {
        "name": "Струйник",
        "forms": "",
        "description": "струйный принтер с одномерной технологией печати (медленная скорость печати по сравнению с лазерным)"
    },
    {
        "name": "Структура",
        "forms": "(от англ. «structure»)",
        "description": "пользовательский тип данных, позволяющий объединить переменные различных типов в едно целое"
    },
    {
        "name": "Субдомен",
        "forms": "(или «поддомен», «дочерний домен», от англ. «subdomain»)",
        "description": "часть домена/отдельный сайт, содержащий в своем имени доменное имя основного сайта. Их создание необходимо, когда нужно создать продолжение к имеющемуся сайту, наделив его определённой функцией Т"
    },
    {
        "name": "Таглайн",
        "forms": "(или «тэглайн», от англ. «TagLine»)",
        "description": "строчка в конце письма, которая является необязательной. Обычно это часть подписи, в которой содержится крылатое выражение, цитата, шутка и т.д."
    },
    {
        "name": "Тап",
        "forms": " (от англ. «tap»)",
        "description": "короткое быстрое нажатие на элемент интерфейса дисплея телефона или планшета, по аналогии с щелчком мышью н компьютере. Соответственно, даблтап – двойное нажатие"
    },
    {
        "name": "Таска",
        "forms": "(от англ. «task»)",
        "description": "какое-либо задание/поручение"
    },
    {
        "name": "Таски",
        "forms": "(от англ. «task»)",
        "description": "заданные цели/задачи, которые предстоит решить"
    },
    {
        "name": "Тач",
        "forms": "(от англ. «touch»)",
        "description": "1) используется как синоним тачпэда или тачскрина; 2) более продолжительное, чем \"тап\", нажатие на сенсорный экран мобильного гаджета. В десктопах аналога не имеет"
    },
    {
        "name": "Тачка",
        "forms": "",
        "description": "так айтишники иногда называют свой компьютер"
    },
    {
        "name": "Тач-н-холд",
        "forms": "(от англ. «touch and hold»)",
        "description": "нажатие и продолжительное удержание пальца или стилуса на тачскрине"
    },
    {
        "name": "Тачпэд",
        "forms": "(или «тачпад», от англ. «touch pad»)",
        "description": "специальная сенсорная панель (на ноутбуке или клавиатуре для Smartт -TV), прикасаясь к которой можно отдавать команды подключенному устройству"
    },
    {
        "name": "Тачскрин",
        "forms": "(от англ. «touch screen»)",
        "description": "сенсорный экран/дисплей устройства (смартфона, планшета, смарт-часов, банкомата и т.д.), который реагирует на касания пальца и позволяет управлять гаджетом без использования кнопок"
    },
    {
        "name": "Твинк",
        "forms": "(от англ. «Twink он же Read-only-user»)",
        "description": "1) в общем смысле: учетная запись, дающая пользователю право только на чтение (просмотр) документа/файла, без возможности редактирования; 2) на форумах: дополнительные учетные записи пользователя, созданные в качестве запасных на случай блокировки основной (иногда, для сокрытия своей личности)"
    },
    {
        "name": "Темплейт",
        "forms": "(от англ. «template»)",
        "description": "шаблон/заготовка, своего рода каркас для документа или письма"
    },
    {
        "name": "Тест",
        "forms": "(от англ. «test»)",
        "description": "1) данные, которые были специально созданы (или подобраны) для организации тестирования продукта (ПО/приложения); 2) система тестирования (в отличие от продуктивной системы или системы разработки)"
    },
    {
        "name": "Тестировщик",
        "forms": "(или «тестер», от англ. «tester»)",
        "description": "it-специалист по тестированию ПО, находящегося в разработке"
    },
    {
        "name": "Технарь",
        "forms": "(от англ. «technic»)",
        "description": "1) в широком смысле: любой человек с техническим (не гуманитарным) образованием; 2) специалист, работающий в бэкенде (бэкенд-разработчик)"
    },
    {
        "name": "Тимлид",
        "forms": "(от англ. «team leader»)",
        "description": "главный разработчик, человек, имеющий в подчинении свою команду разработчиков"
    },
    {
        "name": "Тирлайн",
        "forms": "(или «тиарлайн», от англ. «TearLine»)",
        "description": "в Фидонете: специальная строка, обозначающая завершение текста письма (начинается тремя минусами)"
    },
    {
        "name": "Тисипиайпи",
        "forms": "(от англ. «TCP/IP»)",
        "description": "сетевая модель передачи данных, представленных в цифровом виде. Модель описывает способ передачи данных от источника информации к получателю"
    },
    {
        "name": "Тиснуть",
        "forms": "",
        "description": "сделать клик по кнопке /ссылке/иконке и т.д."
    },
    {
        "name": "Тонна",
        "forms": "",
        "description": "терабайт, единица измерения количества цифровой информации"
    },
    {
        "name": "Топтать кнопки",
        "forms": "",
        "description": "активно печатать что-либо на клавиатуре"
    },
    {
        "name": "Торрент",
        "forms": "(или «BitTorrent»)",
        "description": "технология передачи файлов через Интернет от пользователя к пользователю (без посредничества сервера). Позволяет быстро и эффективно загрузить необходимый файл"
    },
    {
        "name": "Тоссер",
        "forms": "(или «эхотоссер», «эхопроцессор», от англ. «tosser»)",
        "description": "в Фидонете: специальная программа,которая занимается тоссингом , т.е. обработкой баз сообщений"
    },
    {
        "name": "Тоссинг",
        "forms": "(или «тоссенье», от англ. «toss»)",
        "description": "размещение в базе сообщений почты, которую принял мейлер, а также сбор из этих баз уже написанных сообщений и подготовка их к отправке"
    },
    {
        "name": "Точка останова",
        "forms": "(от англ. «breakpoint»)",
        "description": "особый маркер, на котором прерывается процесс выполнения программы и вызывается отладчик"
    },
    {
        "name": "Трабл",
        "forms": "(или «трабла», «грабли», от англ. «trouble»)",
        "description": "беда, проблемы, хлопоты, неприятности"
    },
    {
        "name": "Транслитерация",
        "forms": "(или «транслит», от англ. «transliteration»)",
        "description": "точная побуквенная передача какого-либо текста одной языковой системы знаками/символами другой (например: «pr1vet», 4to delaesh?)"
    },
    {
        "name": "Трафик",
        "forms": "(или «траффик», от англ. «traffic»)",
        "description": "1)массив информации в интернете; 2) количество данных, загруженных из интернета; 3) в Фидонете: объём писем в килобайтах, которыйза определенный временной отрезок проходит через станцию/конференцию"
    },
    {
        "name": "Трейни",
        "forms": "(от англ. «trainee»)",
        "description": "стажёр, младший сотрудник, работник, который не дотягивает знаниями/навыками до уровня Junior-специалиста"
    },
    {
        "name": "Тролль",
        "forms": "",
        "description": "человек, намеренно провоцирующий ссоры и скандалы в различных коммуникационных сетях (чатах, форумах и т.д.)"
    },
    {
        "name": "Троян",
        "forms": "",
        "description": "разновидность вредоносной программы, проникающая в компьютер под видом легитимного ПО и выполняющая команды с удаленного ПК"
    },
    {
        "name": "ТС",
        "forms": "(или «топик стартер», от англ. «topic starter»)",
        "description": "инициатор дискуссии, т.е. человек, предложивший к обсуждению какую-либо тему"
    },
    {
        "name": "ТСП",
        "forms": "(или «туда-сюда протокол», «TCP», от англ. «Transmission Control Protocol»)",
        "description": "транспортный протокол: один из основных протоколов, отвечающий за передачу данных и их сохранность"
    },
    {
        "name": "Тултип",
        "forms": "(от англ. «tooltip»)",
        "description": "подсказка, всплывающая при наведении курсора на какой-либо активный объект интерфейса"
    },
    {
        "name": "Туториал",
        "forms": "(или «тутор», от англ. «tutorial»)",
        "description": "свод подробных обучающих уроков на какую-либо тему"
    },
    {
        "name": "Тэдэшка",
        "forms": "(или «ТД»)",
        "description": "техническая документация: набор графических и текстовых документов проекта"
    },
    {
        "name": "ТэЗэ",
        "forms": "(или «ТЗ», «техзадание,тэзэшка»)",
        "description": "техническое задание: содержит основную информацию о цели и задачах проекта, принципах и правилах его выполнения"
    },
    {
        "name": "Убить",
        "forms": "",
        "description": "означает стереть/удалить что-либо. Например: \"убить приложение\", \"убить эту версию сайта\""
    },
    {
        "name": "Указатель",
        "forms": "(от англ. «pointer»)",
        "description": "переменная, представляющая собой адрес ячейки памяти"
    },
    {
        "name": "Упс",
        "forms": "(или «UPS», от англ. «Uninterruptible Power Supply»)",
        "description": "источник (устройство) беспрерывного питания"
    },
    {
        "name": "Урл",
        "forms": "(или «урла», «урээл», от англ. «URL»)",
        "description": "унифицированный указатель ресурса, определенный шаблон записи гипертекстовых ссылок на объекты в Интернете. Простыми словами, это адрес странички в Сети"
    },
    {
        "name": "Установочник",
        "forms": "(или «дистрибутив», «инсталятор», от англ. «set up»)",
        "description": "программа, устанавливающая выбранное ПО на компьютер"
    },
    {
        "name": "Утечка памяти",
        "forms": "",
        "description": "процесс неконтролируемого уменьшения объёма свободной оперативной или виртуальной памяти компьютера, связанный с ошибками в работающих программах, вовремя не освободивших ненужные участки памяти"
    },
    {
        "name": "Утилита",
        "forms": "(или «утилитка», «тулза», от англ. «utility»)",
        "description": "вспомогательное программное обеспечение, предназначенное для выполнения вспомогательных работ, настройки системного оборудования, операционных систем и прочего. Другими словами, программа, которая помогает что-то сделать"
    },
    {
        "name": "Уши",
        "forms": "",
        "description": "наушники - устройство для персонального прослушивания звуковых сигналов с устройства (музыка, речь и т.д.)"
    },
    {
        "name": "Фаервол",
        "forms": "(или «брандмауэр», от англ. «fire wall»)",
        "description": "программа-антивирус, обеспечивающая обнаружение и защиту компьютера от вирусов и вредоносных ПО"
    },
    {
        "name": "Файлопомойка",
        "forms": "(или «файлообменник»)",
        "description": "1) файловый ресурс (BBS, ftp-сервер) с огромным перечнем беспорядочных несортированных похожих между собой файлов; 2) сервер сети с ресурсами, доступными для общего пользования, на который юзеры сохраняют всё, что необходимо"
    },
    {
        "name": "Файлэха",
        "forms": "(или «фэха», «эха», «эхехеха»)",
        "description": "файловая эхоконференция - форма общения всети Фидонет, средство для рассылки нетекстовых данных"
    },
    {
        "name": "Фак",
        "forms": " (или «ЧаВо», от англ. «FAQ»)",
        "description": "блок ответов на часто задаваемые вопросы. Такой формат материала популярен на различных интернет-площадках и преследует цель заранее дать ответы на популярные вопросы пользователей"
    },
    {
        "name": "Факап",
        "forms": "(или «облом», «фиаско», от англ. «fuck up»)",
        "description": "неудача/провал/облом (чаще имеют ввиду крупные/серьёзные ошибки"
    },
    {
        "name": "Фаста",
        "forms": "(фидошн.)",
        "description": "тоссер FastEcho: пакет ПО (эхопроцессор) для обработки сообщений почтовых систем FTN"
    },
    {
        "name": "Фаундер",
        "forms": "(или «фундер», от англ. «founder»)",
        "description": "1) основатель, создатель, инициатор чего либо; 2) фаундер в IRC-канале форума (тот, кто создал канал)"
    },
    {
        "name": "Фидбек",
        "forms": "(от англ. «feedback»)",
        "description": "1) обратная связь, отзыв, рецензия о чем-либо; 2) в коммерческой сфере: любое упоминания от покупателя/пользователя в сети (отзыв, комментарий, сообщение)"
    },
    {
        "name": "Фидо",
        "forms": "(или «Фидонет», от англ. «FidoNet»)",
        "description": "глобальная любительская некоммерческая не анонимная компьютерная сеть (аналог интернета), созданная по технологии «из точки в точку»"
    },
    {
        "name": "Фидошник",
        "forms": "(или «фидорас»)",
        "description": "член сети фидо, имеющий фидошный адрес"
    },
    {
        "name": "Филе",
        "forms": "(или «филесы», «файло», от англ. «file»)",
        "description": "русифицированное произношение английского file - \"файл\""
    },
    {
        "name": "Фича",
        "forms": "(от англ. «feature»)",
        "description": "уникальная особенность/свойство/функция какого либо объекта (ПО, приложения, ОС)"
    },
    {
        "name": "Флейм",
        "forms": "(или «флэйм», «флэйминг», от англ. «flame»)",
        "description": "\"спор ради спора\", дискуссия, в ходе которой давно утеряна изначальная суть, продолжается в грубой форме с переходом на личности"
    },
    {
        "name": "Флеймер",
        "forms": "(или «флэймер», от англ. «flamer»)",
        "description": "пособник флейма (спора ради спора) или человек, который по своему характеру склонен к его разжиганию и поддержанию"
    },
    {
        "name": "Флик",
        "forms": "(от англ. «flick»)",
        "description": "щелчок по дисплею сенсорного устройства наискосок, после которого происходит движение экрана в заданном направлении"
    },
    {
        "name": "Флоп",
        "forms": "(или «флопик», «флопак», «флопарь», «флоповод», «флоповёрт», «флопогрыз», «флопоглот», от англ. «floppy»)",
        "description": "флоппи-дисковод, предназначенный для считывания информации с дискеты (и записи на нее)"
    },
    {
        "name": "Флуд",
        "forms": "(от англ. «flood»)",
        "description": "засорение чатов или других каналов связи различной информацией, не имеющей отношения к тематике канала (мемы, картинки, текст, обилие сообщений)"
    },
    {
        "name": "Флудить",
        "forms": "(от англ. «flood»)",
        "description": "инициировать появление/генерирование флуда, т.е. обилия информации, не относящийся к теме канала"
    },
    {
        "name": "Флэшка",
        "forms": "(или «флэха», «флешка», от англ. «flash drive»)",
        "description": "1) компактное переносимое запоминающее устройство, которое подключается к ПК через USB-порт; 2) программа на flash"
    },
    {
        "name": "Форвард",
        "forms": "(или «форварднуть», «отфорвардить», от англ. «forward»)",
        "description": "Форвард (форварднуть, отфорвардить, от forward) – переслать поступившее письмо другому пользователю"
    },
    {
        "name": "Формошлёп",
        "forms": "(от англ. «form»)",
        "description": "1) человек с низкой квалификацией, работающий исключительно по готовым шаблонам; 2) специалист, занимающийся разработкой шаблонов веб-сайтов или их версткой (формошлёпством)"
    },
    {
        "name": "Форум",
        "forms": "(от англ. «Forum»)",
        "description": "некоторый сайт/ раздел, созданный с целью организации возможности общения пользователей ресурса"
    },
    {
        "name": "Форумчанин",
        "forms": "(от англ. «Forum»)",
        "description": "завсегдатай/участник, регулярно участвующий в обсуждениях на форуме"
    },
    {
        "name": "Фотожаба",
        "forms": "",
        "description": "любительский фотомонтаж в графическом редакторе, созданный участниками какого-либо сообщества/форума специально под конкретное выложенное изображение"
    },
    {
        "name": "Фотошоп",
        "forms": "(или «фотожоп», «фотожопа», от англ. «Photoshop»)",
        "description": "1) графический редактор Adobe Photoshop; 2) фотожаба, фейковое обработанное изображение/фото"
    },
    {
        "name": "Фреймворк",
        "forms": "(от англ. «framework»)",
        "description": "специальная платформа/ПО, главной задачей которой является облегчение создания, поддержки и объединения разнообразных компонентов проекта/приложения/сервиса и т.д."
    },
    {
        "name": "Фрек",
        "forms": "(или «фрэк», «фидошн», от англ. «freq», «file request»)",
        "description": "файловый запрос (способ, который позволяет одной фидонетовской системе во время сеанса связи с другой запросить у неё некоторые файлы)"
    },
    {
        "name": "Фривар",
        "forms": "(от англ. «freeware»)",
        "description": "ПО, находящееся в свободном доступе (бесплатное)"
    },
    {
        "name": "Фрикер",
        "forms": "(от англ. «phreaker»)",
        "description": "человек, промышляющий взломом ПК, компьютерных и телефонных сетей (использует для взлома не только технологии, но и человеческий фактор: выведывание, подглядывание, обман, шантаж и т.д."
    },
    {
        "name": "Фриланс",
        "forms": "(от англ. «freelance»)",
        "description": "оплачиваемая работа на дому (вне официального штата сотрудников ) Часто фрилансер работает на себя и не имеет постоянных заказчиков и начальства"
    },
    {
        "name": "Фрилансер",
        "forms": "(от англ. «freelancer»)",
        "description": "человек, занимающийся фрилансом (работой на дому: на себя или компанию)"
    },
    {
        "name": "Фронтенд",
        "forms": "(от англ. «front-end»)",
        "description": "создание «внешней оболочки» веб-сайта/приложения (то, что видит пользователь)"
    },
    {
        "name": "Фронтендер",
        "forms": "(от англ. «front-end»)",
        "description": "it-специалист, разработчик фронтэнда (внешнего вида програмного продукта)"
    },
    {
        "name": "Фубар",
        "forms": "(или «Foo и Bar»)",
        "description": "наименования функций/переменных, по которым сложно судить об их назначении (допускается использование в учебной литературе, но запрещается в настоящих проектах)"
    },
    {
        "name": "Фуллстек-разработчик",
        "forms": "(от англ. «full stack»)",
        "description": "разработчик, который одновременно трудится в бэкендее и фронтэнде"
    },
    {
        "name": "Функция",
        "forms": "(от англ. «function»)",
        "description": "это ряд стейтментов для реализации некоторой задачи/задания"
    },
    {
        "name": "Фьюбар",
        "forms": "(от англ. «Fucked Up Beyond Any Repair/Recognition»)",
        "description": "слово общего назначения, дословно переводится с английского как «раздолбанное до неузнаваемости»"
    },
    {
        "name": "Хаб",
        "forms": "(от англ. «hub»)",
        "description": "1) узел какой-либо сети; 2) сетевой концентратор (распространяет трафик от одного подключённого устройства ко всем остальным); 3) крупный раздающий узел сети"
    },
    {
        "name": "Хабовка",
        "forms": "(от англ. «hub»)",
        "description": "разновидность сетёвки, где располагаются даунлинки одного хаба со своими пойнтами"
    },
    {
        "name": "Хак",
        "forms": "(от англ. «hack»)",
        "description": "1) первоначально (появилось в университете Беркли) модификация кода программы, которая позволяет минимизировать размер программы, расширить функционал или ускорить работу, наконец, просто красивое программистское решение; 2) процесс взлома защиты чего-либо, обход какой-либо проблемы; 3) программа-модификатор"
    },
    {
        "name": "Хакатон",
        "forms": "(от англ. «hack marathon»)",
        "description": "мероприятие, где встречаются специалисты из разных отраслей разработки ПО (программисты, дизайнеры, тестеры и т.д.) для работы над общим проектом: приложением, программой"
    },
    {
        "name": "Хакать",
        "forms": "(от англ. «hack»)",
        "description": "1) работать над чем-либо; 2) изучать что-либо; 3) видоизменять написанный код, делать его \"красивым\": устранять ненужные функции или добавлять новые"
    },
    {
        "name": "Хакер",
        "forms": "(от англ. «hacker»)",
        "description": "1) увлеченный знаток компьютерной техники и ПО, являющийся экспертом в этой области (имеет лишь исследовательский интерес, без злого умысла); 2) синоним \"кракера\", кибер-преступника, т.е. человек, использующий свои технические знания во вред другим (взломать, заразить вирусом, добыть закрытую информацию и т.д.)"
    },
    {
        "name": "Хакинг",
        "forms": "(от англ. «hack»)",
        "description": "процесс преобразования некоторых элементов ПО для определённых целей, которые ему не свойственны"
    },
    {
        "name": "Хард",
        "forms": "(или «винт», «харддиск», от англ. «hard disk»)",
        "description": "накопитель, состоящий из жёстких магнитных дисков (НЖМД, жёсткий диск, винчестер); 2) аппаратное обеспечение компьютера, т.е. его комплектующие"
    },
    {
        "name": "Хардкодить",
        "forms": "(от англ. «hardcore»)",
        "description": "привычка статически прописывать в коде данные, которые по правилам должны вычисляться динамически. Практика считается плохой, антипаттерн в программировании"
    },
    {
        "name": "Хард скиллы",
        "forms": "(от англ. «hard skills»)",
        "description": "лубокие/значительные технические знания, умения и опыт"
    },
    {
        "name": "Хатчить",
        "forms": "(от англ. «hatch»)",
        "description": "загружать/\"закидывать\" какие-либо файлы в файлэху"
    },
    {
        "name": "Хатээмэль",
        "forms": " (или «хатэмээль», «хэтемээль»)",
        "description": "руссифицированное произношение HTML (HyperText Markup Language): язык гипертекстовой разметки, который используется для написания документов для веб-сайтов"
    },
    {
        "name": "Хидден",
        "forms": "(от англ. «hidden»)",
        "description": "1) то, что существует, но сокрыто от посторонних взглядов (к примеру, некоторые элементы интерфейса); 2) в Фидонете: невидимая/скрытая служебная строчка в письме; 3) логический HTML-атрибут, который скрывает элементы, которым назначен"
    },
    {
        "name": "Хинт",
        "forms": "(от англ. «hint»)",
        "description": "1) в общем смысле: совет/рекомендация/подсказка; 2) в графическом дизайне: элемент интерфейса, представляющий собой всплывающий текст-подсказку для обучения юзера"
    },
    {
        "name": "Хит",
        "forms": "(от англ. «hit»)",
        "description": "1) просмотр одной странички сайта; 2) запрос к веб-серверу с целью получения необходимого файла (страницы, картинки, скрипта, таблицы и т. д.)"
    },
    {
        "name": "Холивар",
        "forms": "(или «холивор», от англ. «holy war»)",
        "description": "дословно \"святая война\", агрессивный спор между представителями противоположных мнений в интернете"
    },
    {
        "name": "Хомяк",
        "forms": "(или «пага», от англ. «home page»)",
        "description": "1) стартовая (домашняя) интернет страница, открывающаяся при открытии браузера; 2) персональный сайт"
    },
    {
        "name": "Хост",
        "forms": "(от англ. «hosting»)",
        "description": "центральный сервер сети (любой компьютер), подключённый к локальной или глобальной сети"
    },
    {
        "name": "Хостер",
        "forms": "(или «хостинг-провайдер», «веб-хостер», «HSP», от англ. «hosting»)",
        "description": "компания, предоставляющая услуги хостинга (размещения на своей площадке сайтов/оборудования/данных)"
    },
    {
        "name": "Хостинг",
        "forms": "",
        "description": "услуга, позволяющая разместить свой сайт на выделенном или виртуальном сервере"
    },
    {
        "name": "Хоститься",
        "forms": "(от англ. «hosting»)",
        "description": "пользоваться услугами хостингов"
    },
    {
        "name": "Хоткей",
        "forms": "(от англ. «hotkey»)",
        "description": "горячая клавиша (или сочетание клавиш для быстрого доступа к необходимым командам"
    },
    {
        "name": "Хотфикс",
        "forms": "(от англ. «hot fix»)",
        "description": "исправление обнаруженных ошибок (багов), требующее немедленного решения/с горящими сроками"
    },
    {
        "name": "Хрюша",
        "forms": "",
        "description": "1) транслитерация ОС Winsows XP (также: хря, хэрэ, хрень); 2) специалист HR (от «Human Resources»), занимающийся подбором/рекрутом кадров."
    },
    {
        "name": "Хэдер",
        "forms": "(или «хедер», от англ. «header»)",
        "description": "1) элемент веб-страницы, расположенный в верхней его части и содержащий: логотип, меню, служебную информацию и т.д. 2) заголовочный файл библиотеки (.h)"
    },
    {
        "name": "ХэПэ",
        "forms": "(или «хьюлет пакарт»)",
        "description": "русифицированная аббревиатура компании Hewlett Packard"
    },
    {
        "name": "Целочисленный тип данных",
        "forms": "",
        "description": "тип, при котором переменные способны содержать исключительно целые числа (без дробной части)"
    },
    {
        "name": "Цикл",
        "forms": "(от англ. «Cycle»)",
        "description": "в программировании: некая языковая конструкция, заставляющая программу неоднократно исполнять определенные инструкции до тех пор, пока заданное условие не станет ложным/истинным"
    },
    {
        "name": "ЦМ",
        "forms": "(или «ЦМный», «цээм», «цээмный»)",
        "description": "круглосуточный; происходит от того, что в строке нодлиста для круглосуточно работающего узла ставится флаг CM (от Continuous Mail — беспрерывная передача почты)"
    },
    {
        "name": "ЦОД",
        "forms": "(или «центр обработки данных», «дата-центр», от англ. «data center»)",
        "description": "место расположения (хостинга) серверов/ИТ-инфраструктуры с целью обеспечения их бесперебойного функционирования"
    },
    {
        "name": "ЦП",
        "forms": "(или «проц», «цпу», «процик», «CPU», от англ. «central processing unit»)",
        "description": "компьютерный компонент, обрабатывающий машинный код. Отвечает за интерпретацию и выполнение большинства команд от другого аппаратного и программного обеспечения компьютера"
    },
    {
        "name": "Цэмээс",
        "forms": "(или «цээмэс», от англ. «CMS»)",
        "description": "система управления контентом, которая используется для обеспечения и организации совместной работы над его созданием, редактированием и управлением"
    },
    {
        "name": "Цээсэс",
        "forms": "(от англ. «Cascading Style Sheets»)",
        "description": "формальный язык, в котором содержится набор определенных свойств для описания внешнего вида любых HTML документов"
    },
    {
        "name": "ЧаВо",
        "forms": "(или «FAQ», «фак»)",
        "description": "сокр. от «ЧАсто задаваемые ВОпросы». Блок ответов на часто задаваемые вопросы. Такой формат материала популярен на различных интернет-площадках и преследует цель заранее дать ответы на популярные вопросы пользователей"
    },
    {
        "name": "Чайник",
        "forms": "",
        "description": "новичок, неопытный начинающий пользователь, который пока плохо разбирается в чем-либо"
    },
    {
        "name": "Чат",
        "forms": "(от англ. «chat»)",
        "description": "способ общения пользователей сети в режиме реального времени, по средствам обмена текстовыми сообщениями"
    },
    {
        "name": "Чекать",
        "forms": "(от англ. «check»)",
        "description": "что-то проверять, просматривать на предмет необходимой информации или для поиска ошибок"
    },
    {
        "name": "Чекбокс",
        "forms": "(или «флажок», «флаговая кнопка», «галка», от англ. «check box»)",
        "description": "элемент графического интерфейса, который дает пользователю возможность управлять параметром с двумя состояниями (например, ☑ включено и ☐ отключено)"
    },
    {
        "name": "Чекиниться",
        "forms": "(или «зачекиниться», от англ. «check-in»)",
        "description": "поставить отметку, подтверждающую ваше присутствие в каком-то определенном месте/мероприятии"
    },
    {
        "name": "Челлендж",
        "forms": "(от англ. «challenge»)",
        "description": "1) необычная нестандартная проблема/задача, решение которой можно считать своим достижением; 2) в социальных сетях: некая последовательность действий/слов, которую повторяет большое количество пользователей"
    },
    {
        "name": "Червь",
        "forms": "(от англ. «worm»)",
        "description": "вирус (вредоносное ПО), проникающий в компьютер через локальную/глобальную компьютерную сеть"
    },
    {
        "name": "Черрипик",
        "forms": "(от англ. «cherry picking»)",
        "description": "Команда git cherry-pick применяется для перенесения некоторых коммитов из одного места репозитория в другое"
    },
    {
        "name": "Читерство",
        "forms": "(от англ. «cheating»)",
        "description": "в компьютерных играх: процесс приобретения обманным путем каких-либо привилегий путем использования чит-кодов и специального ПО"
    },
    {
        "name": "Чит-код",
        "forms": "(или «чит», от англ. «cheat code»)",
        "description": "в сфере компьютерных игр: определенных набор символов, который вводится в командную строку для получения каких-либо ресурсов/преимуществ/привилегий"
    },
    {
        "name": "Читкодер",
        "forms": "(или «читер», от англ. «cheat code»)",
        "description": "в сфере компьютерных игр: игрок, применяющий специальные чит-коды, которые дают определенные привилегии и бонусы"
    },
    {
        "name": "ЧПУ",
        "forms": "",
        "description": "расшифровывается как \"человекопонятный url\". Это адрес страницы, отображаемый в адресной строке, состоящий из понятных для пользователя символов, коротко отражающих содержание активной страницы"
    },
    {
        "name": "Шаблон",
        "forms": "(от англ. «pattern»)",
        "description": "дает возможность создать единую версию функции/класса (экземпляр), работающую с различными типами данных"
    },
    {
        "name": "Шаблоны функций",
        "forms": "(от англ. «Function Template»)",
        "description": "в языке С++: функции, использующиеся как образец/шаблон при создании похожих функций без уточнения типа(ов) некоторых или всех переменных)"
    },
    {
        "name": "ШАР",
        "forms": "(или «WAP»)",
        "description": "протокол беспроводного доступа /передачи данных WAP, созданный для сетей GSM. Он позволяет установить связь мобильного устройства с сетью Интернет без помощи компьютера/модема (например, «зайти с телефона на шар», то есть на WAP-портал)"
    },
    {
        "name": "Шара",
        "forms": "(или «шары», «шарные или расшареные ресурсы», от англ. «shared»)",
        "description": "открытые для общего доступа файлы, папки, диски и т. п."
    },
    {
        "name": "Шарить",
        "forms": "",
        "description": "1) хорошо понимать, отлично разбираться в чём-либо; 2) \"шерить\", т.е. давать дугим доступ к чему-то, обычно к определенным папкам, файлам, хранилищам"
    },
    {
        "name": "Шаровары",
        "forms": "(от англ. «shareware»),",
        "description": "коммерческое ПО, которое является условно-бесплатным, т.е. его свободное распространение не подразумевает его принадлежность к свободному ПО"
    },
    {
        "name": "Шарпы",
        "forms": "",
        "description": "современный объектно-ориентированный язык программирования C# (в противовес языку C++ – «плюсам»). Его применяют при работе с программами для ПК, создании сложных веб-сервисов или мобильных приложений"
    },
    {
        "name": "Шильдик",
        "forms": "(от англ. «nameplate»)",
        "description": "наклейка/табличка, содержащая информацию о маркируемом изделии: модель/основные технические характеристики и т.д."
    },
    {
        "name": "Ширина пула",
        "forms": "(от англ. «pool»)",
        "description": "число модемов в модемном пуле (зачастую, у интернет-провайдера)"
    },
    {
        "name": "Шланг",
        "forms": "(или «шнурок»)",
        "description": "сетевой кабель для интернет-соединения и передачи данных"
    },
    {
        "name": "Шредер",
        "forms": "(от англ. «shredder»)",
        "description": "1) агрегат для утилизации использованной офисной бумаги; 2) ПО, предназначенное для полного удаления файлов с компьютера (избегая корзины)"
    },
    {
        "name": "Эксель",
        "forms": "(или «эксэль», от англ. «Excel»)",
        "description": "табличный процессор Microsoft Excel - популярная программа для работы с электронными таблицами"
    },
    {
        "name": "Экскоммуникация",
        "forms": "",
        "description": "отключение системы от фидо, т.е. отказ узлов сети в установлении связи с экскоммуницируемым узлом сети («экскоммуницировали» значит «выгнали из фидо»)"
    },
    {
        "name": "Эксплойт",
        "forms": "(от англ. «exploit»)",
        "description": "фрагмент кода или вредоносная программа кода, которая способна выполнять атаки на вычислительную систему через найденную уязвимость в другой программе"
    },
    {
        "name": "Электронная почта",
        "forms": "(или «Емейл», «мыло», от англ. «e-mail»)",
        "description": "технология и служба по отправке и получению сообщений в электронном формате между пользователями компьютерной сети"
    },
    {
        "name": "Эникей",
        "forms": "(от англ. «any key»)",
        "description": "любая клавиша на клавиатуре. Нередко, при установке или загрузке программы/приложения, всплывает уведомление “Press any key” — отсюда и термин"
    },
    {
        "name": "Эникейщик",
        "forms": "(от англ. «any key»)",
        "description": "работник IT-сферы с низкой квалификацией, занимающийся шаблонными, простыми задачами"
    },
    {
        "name": "Эпикфэйл",
        "forms": "(от англ. «epic fail»)",
        "description": "дословно переводится как \"эпический провал\". Фиаско, крах, серьезная неудача"
    },
    {
        "name": "Эфайщик",
        "forms": "",
        "description": "эксперт по модулю SAP FI , автоматизирующий процессы бухгалтерского и финансового учета"
    },
    {
        "name": "Эффект боке",
        "forms": "(или «расфокус», от англ. «Bokeh effect»)",
        "description": "намеренное мягкое размытие/\"замыливание\" заднего (или переднего) плана в процессе фото-съемки для выделения главного объекта. При использовании фотоаппарата достигается путём регулировки фокусного расстояния, а в смартфонах реализуется с помощью специальных программ или за счёт нескольких камер с разным фокусным расстоянием"
    },
    {
        "name": "Эха",
        "forms": "(или «эхоконференция»)",
        "description": "в Фидонете: форма общения, аналогичная по составу и своим возможностям новостным группам, т.е. представляет собой место публикации сообщений по определённой тематике"
    },
    {
        "name": "Эхотаг",
        "forms": "(от англ. «Echo tag»)",
        "description": "строка со служебным названием эхоконференции (эхи)"
    },
    {
        "name": "Юзабилити",
        "forms": "(от англ. «usability»)",
        "description": "показатель удобства работы пользователя с тем или иным продуктом или объектом"
    },
    {
        "name": "Юзать",
        "forms": "(от англ. «use»)",
        "description": "использовать/применять/пользоваться (например: \"дай мне поюзать твой самокат\")"
    },
    {
        "name": "Юзверь",
        "forms": "(от англ. «use»)",
        "description": "то же, что \"юзер\", только еще более активный"
    },
    {
        "name": "Юзер",
        "forms": "(от англ. «user»)",
        "description": "активный пользователь компьютера или Сети, идет сразу после \"чайника\""
    },
    {
        "name": "Юзерпик",
        "forms": "(или «аватар», «аватарка», от англ. «user picture»)",
        "description": "графическое обозначение пользователя в Интернете (картинка/фото/изображение)"
    },
    {
        "name": "Юзнуть",
        "forms": "(или «поюзать», от англ. «use»)",
        "description": "немного попользоваться каким-то устройством, попробовать разобраться с незнакомым функционалом приложения/программы"
    },
    {
        "name": "Юникс",
        "forms": "(или «юних», «уних», от англ. «Unix»)",
        "description": "семейство гибких, многозадачных и многопользовательских ОС, характеризующихся модульным дизайном, где каждая задача выполняется отдельной утилитой, взаимодействуя посредстом единой файловой системы"
    },
    {
        "name": "Яблочник",
        "forms": "(или «яблофаг», от англ. «Apple»)",
        "description": "активный пользователь устройств бренда Apple или ярый фанат компании Apple"
    },
    {
        "name": "Яндекс",
        "forms": "(от англ. «Yandex»)",
        "description": "поисковая система и интернет-портал от российской транснациональной компании"
    },
    {
        "name": "ЯП",
        "forms": "",
        "description": "язык программирования - формальный язык, предназначенный для записи компьютерных программ"
    },
    {
        "name": "Ярлык",
        "forms": "(или «шорткат», «шорткут», от англ. «shortcut»)",
        "description": "разновидность значка, указывающего на объект. У объекта может быть бесконечно много ярлыков. Их размещают там, где это удобно (обычно на рабочем столе), и используют для обращения к объектам (чаще всего для запуска программ)"
    }
]